[{"sha":"cf84297c3574ccd375ab24a9379199e2f66421fc","node_id":"MDY6Q29tbWl0MjU5NzM1NzczOmNmODQyOTdjMzU3NGNjZDM3NWFiMjRhOTM3OTE5OWUyZjY2NDIxZmM=","commit":{"author":{"name":"MMMiracles","email":"lolaccount1@hotmail.com","date":"2020-12-04T04:54:26Z"},"committer":{"name":"GitHub","email":"noreply@github.com","date":"2020-12-04T04:54:26Z"},"message":"me updating my fork (#1)\n\n* Automatic changelog generation for PR #54783 [ci skip]\r\n\r\n* Makes it so living crate creatures can pass plastic flaps as god intended. (#55088)\r\n\r\n* Automatic changelog generation for PR #55088 [ci skip]\r\n\r\n* improves away missions and load times (#55055)\r\n\r\n* improves away missions and load times\r\n\r\n* snowed inn\r\n\r\n* Automatic changelog generation for PR #55055 [ci skip]\r\n\r\n* Fixes cryogenics infinite gas deletion (#55068)\r\n\r\n* cryo fixes and cleanup\r\n\r\nMove magic numbers to defines\r\nFixes cryo deleting 100L of gas each time it transfers\r\nRemove unneeded/unused variables\r\nMoves gas all gas consumption to process_atmos\r\ndelta_time in process_atmos\r\n\r\n* simplify consume_gas\r\n\r\n* Automatic changelog generation for PR #55068 [ci skip]\r\n\r\n* Hygienebots de/construct and behave like the other simplebots. (#55089)\r\n\r\nAdds simple deconstruct steps to the hygiene bot assembly, as well as adds a simple crafting menu option to craft one.\r\nAlso, corrects an issue with hygienebots not needing to be opened in order to be emagged. They now need to be emagged to be opened with a screwdriver, then emag the open panel in order to emag the robot, just like every other robot.\r\n\r\n* Automatic changelog generation for PR #55089 [ci skip]\r\n\r\n* Reload verbs when the client goes into a new mob (#55106)\r\n\r\nTry this experiment at home:\r\n\r\n    1.Ctrl shift click your ghost\r\n    2.Notice that you still have the Ghost tabs, and you don't see OOC > Ghost, uh oh.\r\n\r\nThis happens for more than ctrl-shift-clicking, it happens a lot with event mobs.\r\n\r\nThis reloads verbs on /mob/Login, aka when the client goes into a new mob (or when they reconnect).\r\n\r\n* Automatic changelog generation for PR #55106 [ci skip]\r\n\r\n* Moves grown food to newfood (#55040)\r\n\r\nMoves grown food to newfood\r\nGives trash element support for callbacks for item creation override\r\n\r\n* Automatic changelog generation for PR #55040 [ci skip]\r\n\r\n* shuttle catastrophe now cant trigger if it already happened (#55114)\r\n\r\nShuttle catastrophe now cant trigger if it already happened\r\n\r\n* Automatic changelog generation for PR #55114 [ci skip]\r\n\r\n* Automatic changelog compile [ci skip]\r\n\r\n* Foam darts and other unembeddable bullets will no longer leave ghost shrapnel (#54994)\r\n\r\nProjectiles are assigned the ability to try embedding by the presence of a shrapnel_type variable being set on them, whether or not they actually have a set of embedding stats in their embedding var. By default, children of /obj/projectile/bullet have a shrapnel type set to a generic embedded bullet item, including things like foam darts and lollypop projectiles which shouldn't be able to embed (and certainly not embed as a bullet). While they had their embedding vars set to null, they still had their shrapnel_type set to the embedded bullet type, meaning shooting a person with a dart gun or whatever would leave a failed shrapnel item on the ground where they weren't supposed to.\r\n\r\nThis fixes that by requiring both a defined shrapnel_type AND a defined embedding var for the embedding stats. Any projectiles without both won't be able to try embedding. I also manually put 'shrapnel_type = null' on any bullet subtypes with embedding = null just to be safe and for consistency.\r\n\r\n* Automatic changelog generation for PR #54994 [ci skip]\r\n\r\n* Automatic changelog compile, [ci skip]\r\n\r\n* removes a direct use of Destroy() (#55043)\r\n\r\n* cursed\r\n\r\n* Update code/datums/mutations/antenna.dm\r\n\r\nCo-authored-by: Jordan Brown <Cyberboss@users.noreply.github.com>\r\n\r\n* Update code/datums/mutations/antenna.dm\r\n\r\nCo-authored-by: spookydonut <github@spooksoftware.com>\r\n\r\n* Update code/datums/mutations/antenna.dm\r\n\r\nCo-authored-by: spookydonut <github@spooksoftware.com>\r\n\r\nCo-authored-by: Jordan Brown <Cyberboss@users.noreply.github.com>\r\nCo-authored-by: spookydonut <github@spooksoftware.com>\r\n\r\n* Automatic changelog generation for PR #55043 [ci skip]\r\n\r\n* additions no longer runtime on medical kiosks. (#55125)\r\n\r\n* UNIQUE_RENAME respects labels (#55121)\r\n\r\n* Automatic changelog generation for PR #55121 [ci skip]\r\n\r\n* path funeneee (#55119)\r\n\r\n* Automatic changelog generation for PR #55119 [ci skip]\r\n\r\n* Lowers Stasis Bed Overlay below objects to prevent overlay issues. (#55082)\r\n\r\n* Automatic changelog generation for PR #55082 [ci skip]\r\n\r\n* one character fix (#55067)\r\n\r\n* Automatic changelog generation for PR #55067 [ci skip]\r\n\r\n* Fixing the point emote being both usable and unusable (#55063)\r\n\r\n* Automatic changelog generation for PR #55063 [ci skip]\r\n\r\n* Fixes tool implant tools being storable in boxes (#54914)\r\n\r\n* Moves storing tool implant items to use the drop hotkey rather than a dropped item event\r\n\r\n* de-debugging\r\n\r\n* Automatic changelog generation for PR #54914 [ci skip]\r\n\r\n* Makes APCs not cause runtimes when placed in space (#55045)\r\n\r\n* Automatic changelog generation for PR #55045 [ci skip]\r\n\r\n* This makes me sad (#55007)\r\n\r\n* Automatic changelog generation for PR #55007 [ci skip]\r\n\r\n* Detect if ghost reentered the brain (#54975)\r\n\r\n* Automatic changelog generation for PR #54975 [ci skip]\r\n\r\n* make sure slowdown effects get removed when items are unequipped (#54947)\r\n\r\n* Fixes PDA bombing have equal chances to work on PDAs without manifest access vs PDAs with it (#55036)\r\n\r\n* Makes extra difficulty actually work\r\n\r\n0\r\n\r\n* Actually fixes it as of what Fikou suggested\r\n\r\n* no space, sorry\r\n\r\nCo-authored-by: ATH1909 <42606352+ATH1909@users.noreply.github.com>\r\n\r\nCo-authored-by: ATH1909 <42606352+ATH1909@users.noreply.github.com>\r\n\r\n* Automatic changelog generation for PR #55036 [ci skip]\r\n\r\n* Deconstructed computer consoles no longer delete their own circuits. (#55126)\r\n\r\n* Feex\r\n\r\n* Remove newline\r\n\r\n* Automatic changelog generation for PR #55126 [ci skip]\r\n\r\n* Fixes dish drives spitting out components on interact. (#55065)\r\n\r\n* stop vomiting components ok mr dishdrive\r\n\r\n* remember to do the dishes!\r\n\r\n* lazyadds and lazylens\r\n\r\n* actually lazy now\r\n\r\n* Automatic changelog generation for PR #55065 [ci skip]\r\n\r\n* man adds a single ? (#55129)\r\n\r\n* Automatic changelog generation for PR #55129 [ci skip]\r\n\r\n* Prevents mecha drills from stacking do_afters on the same target. (#55145)\r\n\r\n* Feex\r\n\r\n* Feex 2.0 Feexlectric Feexaloo\r\n\r\n* Whitespace purge\r\n\r\n* Automatic changelog generation for PR #55145 [ci skip]\r\n\r\n* tgui: Safe (#55109)\r\n\r\nThis PR refactors safes and brings their UI from html to tgui based on the PR above.\r\n\r\nParadise has more features for safes than us, and these features were not ported along to accommodate feature freeze. Only our current safe features settings were refactored, for example number of tumblers stays 2, no extra safe information on examine and safe codes are not generated on paper for command.\r\n\r\nCo-authored-by: Aleksej Komarov <stylemistake@gmail.com>\r\n\r\n* Automatic changelog generation for PR #55109 [ci skip]\r\n\r\n* Fixes lightbulb injections (#55132)\r\n\r\nCo-authored-by: itseasytosee <55666666+itseasytosee@users.noreply.github.com>\r\nCo-authored-by: Jared-Fogle <35135081+Jared-Fogle@users.noreply.github.com>\r\n\r\n* Automatic changelog generation for PR #55132 [ci skip]\r\n\r\n* Fixes #55112 - Swapping items no longer eats things (#55122)\r\n\r\nQuick swapping items no longer hides them in the mobs contents\r\n\r\n* Automatic changelog generation for PR #55122 [ci skip]\r\n\r\n* Automatic changelog compile [ci skip]\r\n\r\n* Refactors Pastries into newfood. (#54996)\r\n\r\nCo-authored-by: Jared-Fogle <35135081+Jared-Fogle@users.noreply.github.com>\r\nCo-authored-by: Floyd <Floydje123@hotmail.com>\r\n\r\n* Automatic changelog generation for PR #54996 [ci skip]\r\n\r\n* Humans have more complicated body temperatures (#54550)\r\n\r\nThis changes how carbon/humans stabilize body temperature, and changes how damage and wounds are applied based on temperature.\r\n\r\nHumans now have a core body temperature along with body temperature. The core temperature is used for natural stabilization and what viruses like fever and shivers target by raising or lowing the core temperature of the mob.\r\nThe standard body temperature still exists and acts exactly the same for most items at this time but is now treated as surface temperature in humans.\r\n\r\nDamage from body temperature for humans is now based on the core temperature instead of body temperature now.\r\nHumans will now receive burn wounds when the body (surface) temperature is to high for to long.\r\n\r\nThis causes you to see alerts for the area temperature before you take damage in most cases improving visibility of dangerous situations.\r\n\r\n* Automatic changelog generation for PR #54550 [ci skip]\r\n\r\n* Fixes chem and addiction scans, null checks for addiction_list (#55105)\r\n\r\nSo #54797 changed addiction_list to instantiate as a null instead of a list. Turns out a few things relied on the list existing!\r\nThings like health analyser/medical kiosk chem and addiction scans broke, and smokers would no longer get addicted!\r\nMade a few places check if addiction_list is null before continuing.\r\n\r\n(Lemon's note, refactored some code to make it cleaner/removed some unneeded loop typechecks)\r\n\r\n* Automatic changelog generation for PR #55105 [ci skip]\r\n\r\n* Moves sorting of crew console listings to clientside + refactors (#55124)\r\n\r\nMoves the sorting of the entries within the crew console to be clientside. There's no reason to have this serverside.\r\n\r\nI've also refactored the UI data code for the crew console in general, reduced code duplication and reduced unnecessary data transfer of nulls.\r\n\r\n* Automatic changelog generation for PR #55124 [ci skip]\r\n\r\n* CanUseTopic() refactor. (#54747)\r\n\r\n* CanUseTopic() refactor.\r\n\r\n* Forgot about default_can_use_topic. Tested and working.\r\n\r\n* Update bin.dm\r\n\r\n* no-nonsense.\r\n\r\n* Automatic changelog generation for PR #54747 [ci skip]\r\n\r\n* tgui: Fix issues detected by SonarQube (#55098)\r\n\r\n* tgui: Fix issues detected by sonarqube\r\n\r\n* MacOS compatibility\r\n\r\n* Rebuild tgui\r\n\r\n* Nerfs GBP gain (#55038)\r\n\r\nBasically no one ever hits the lower limit and people have fucking bank at this point.\r\n\r\n* Replace tgalert with tgui_alert (#55157)\r\n\r\nAdds TGUI-based alerts to replace the old tgalert system. Replaces all uses of tgalert with tgui_alert except for one, the 'Report Issue' button, as people were (understandably) concerned that this button using tgui will prevent a tgui bug from being easily reported.\r\n\r\nThese windows have a nice little progress bar indicator of how much time they have left, and will automatically close themselves after this time elapses.\r\n\r\nCo-authored-by: Aleksej Komarov <stylemistake@gmail.com>\r\n\r\n* Automatic changelog generation for PR #55157 [ci skip]\r\n\r\n* Fixes template use for 'Report Issue' button in-game + show [s] testmerged prs (#55135)\r\n\r\nFixed and improved the bug report template use when the 'Report Issue' button is used in-game. It now uses the correct template location, as well as automatically filling in the round ID and testmerges.\r\n\r\nWe also now show [s] PRs that are testmerged, as ok-d by oranges, as this is an unofficial label that anyone can apply and doesn't necessitate hiding. It also makes debugging rounds where this was present but not reported more difficult.\r\n\r\n* Automatic changelog generation for PR #55135 [ci skip]\r\n\r\n* Feex (#55144)\r\n\r\nFor whatever reason we hardcoded the health value for drills at 200 brute damage before they can gib. 200 brute damage was picked as it was double the max health of /mob/living/carbon/whatever and double the max health was like, the cap on brute damage when someone is really, really, really, really dead.\r\n\r\nEnter simplemobs. Their max health is regularly under 100, which means a hardcoded value of 200 brute damage to trigger gibbing effects is bad. Not that it matters anyway, because simplemobs also brute damage cap at maxHealth instead of maxHealth * 2 so the only simplemobs that could be gibbed by mech drills are those with 200 or more health.\r\n\r\nThis has been changed. Simplemobs now cap out at maxHealth * 2 damage, in line with all other /mob/living while drill code has been changed to check for maxHealth * 2 when gibbing instead of a hardcoded 200.\r\n\r\n* Automatic changelog generation for PR #55144 [ci skip]\r\n\r\n* Automatic changelog compile [ci skip]\r\n\r\n* Fixes cyborgs in general replenishing stack modules from external sources (#54935)\r\n\r\n* Cyborg stack fix\r\n\r\n- Makes cyborgs capable of recycling floor tiles again\r\n\r\n* Touches up module code\r\n\r\n- Makes module code slightly more OOP-compliant\r\n- Speeds up module creation by an imperceptable amount\r\n- Reworks how borg modules handle stacks\r\n\r\n* Automatic changelog generation for PR #54935 [ci skip]\r\n\r\n* Fixing non wiz phased mobs. (#55162)\r\n\r\nWrong proc path, also qdel ref issue for shadow walk holder.\r\nThis will close #55141 and close #55142\r\nfix: Nightmares and some other critters no longer delete themselves once they stop phasing.\r\n\r\n* Automatic changelog generation for PR #55162 [ci skip]\r\n\r\n* Fixes forced speech nanite oversight (#55164)\r\n\r\nAll of the stunning emotes were blacklisted from the forced speech program. However, *faint was not added this to the list, and this is an oversight. This is a simple one line fix to add it to the blacklist.\r\n\r\n* Automatic changelog generation for PR #55164 [ci skip]\r\n\r\n* Accidental Consumption post-food refactor cleanup (#55152)\r\n\r\n    Renames a bunch of vars to be more descriptive\r\n    Removes old references to snacks\r\n    Updates some code slightly\r\n\r\n* Automatic changelog generation for PR #55152 [ci skip]\r\n\r\n* Remove the hyphen from the default value of the github url string (no longer -tg-station) (#55136)\r\n\r\n* Fixes an adminPM dead end eating replies (#55127)\r\n\r\nIf you tried to reply to an admin that had deadminned while you were typing you would get an error and your message was eaten. Now sends to MessageNoRecipient if theres an open ticket, or prints a warning and the message in chat if there isn't.\r\n\r\n* Automatic changelog generation for PR #55127 [ci skip]\r\n\r\n* Fixes picked up bees, again (#55053)\r\n\r\nBees don't actually have a set icon state, their entire existence is their mutable appearance. This creates problems when something checks for the bee's icon state, like mob_holders. So, this PR sets their icon_state to the corresponding base bee icon on initialization. Visually identical to before, because the overlays / mutable appearance covers it, but their icon_state is no longer null.\r\n\r\n* Automatic changelog generation for PR #55053 [ci skip]\r\n\r\n* Pixels peeve about the galaxy suit (#55165)\r\n\r\nAdded a few pixels to the left and right sprites of the galaxy suits.\r\n\r\n* Automatic changelog generation for PR #55165 [ci skip]\r\n\r\n* Fixes some food item sizes (#55174)\r\n\r\n* Automatic changelog generation for PR #55174 [ci skip]\r\n\r\n* tgui: Stacking Machine Console and Safe UI fix (#55171)\r\n\r\nThis PR refactors Stacking Machine Console from using html based UI to tgui with some code cleanup and documentation. Also fixes a bug I noticed when using Stacking Machine Console - some materials could get stuck there if they were number subtypes (for example /obj/item/stack/sheet/metal/twenty), because console did not check for their merge_type for releasing like stacking machine itself does when the sheet is put inside. This is fixed now.\r\n\r\nAlso fixes a small safe UI bug, where some buttons could be hard to press due to the dialer image being too close to the buttons. Bundling this together to prevent merge conflicts with other tgui PRs. Fixes #55169\r\n\r\n* Automatic changelog generation for PR #55171 [ci skip]\r\n\r\n* Merge type variable fixes and unit test (#55173)\r\n\r\nThis PR fixes a case where certain materials caused issues when working with stacking machines, because they did not have set merge_type from the get go, which meant that initial() of that variable returned null.\r\n\r\nTo clarify further - if /obj/item/stack does not have set merge_type, it is generated merge_type upon Initialize(), which is the same as its typepath. For example, currently /obj/item/stack/sheet/bluespace_crystal does not have any merge_type set, and it is given merge_type = /obj/item/stack/sheet/bluespace_crystal upon Initialize(). Each Initialize(). Again and again.\r\n\r\nThere are quite a bit of these cases in the codebase, especially if its some older code. I have gone through them and set all of them their set merge_type, which they would inevitably receive anyway upon initializing and it fixes a bug mentioned above.\r\n\r\nTo prevent this happening again, I have also included unit test to check if merge types are set for stacks, included exceptions are usually abstract paths like /obj/item/stack/sheet/mineral, which contains zero behavior on its own and does not spawn unless done via admin tools.\r\n\r\n* Automatic changelog generation for PR #55173 [ci skip]\r\n\r\n* Being flashed by a portable flasher is now logged (#55137)\r\n\r\nGetting stunned by a portable flasher will now be reflected in your attack logs\r\n\r\n* Fixes Improvised Jetpack (+New custom icons) (#55177)\r\n\r\nThis fixes the improvised jetpack, which currently cannot be activated.\r\nFixed [#50396](https://github.com/tgstation/tgstation/issues/50396)\r\n\r\nThe code change was very minor and everything seems to work properly now.\r\nBonus: New custom icons for this item, better representing what it most likely would look like\r\n\r\n* Automatic changelog generation for PR #55177 [ci skip]\r\n\r\n* Removes a source of ian harddels, keeps mcgruffs bed discription from getting overwritten at roundstart, moves the bed claiming feature to just the dogbed typepath, none of the subtypes, this applies to buckling too (#55158)\r\n\r\nRemoves a source of ian harddels, keeps mcgruff's bed description from getting overwritten at roundstart, moves the bed claiming feature to just the dogbed typepath, blacklisting subtypes. This applies to buckling too.\r\n\r\nThis means that a dogbed can only ever belong to one dog. Fuck you.\r\nRemake of #54892, github doesn't like force pushes, not sure why\r\n\r\n* Automatic changelog generation for PR #55158 [ci skip]\r\n\r\n* Fixes cleric mace handles (#55163)\r\n\r\n* Automatic changelog generation for PR #55163 [ci skip]\r\n\r\n* Fixes male underwear/shirts poking through clothes (#55139)\r\n\r\nWhile investigating a strange intermittent issue with skirts and such randomly losing a pixel in the crotch they weren't supposed to, I found another underwear/undershirt issue. Female characters and plural characters with a female bodytype wearing mens underwear and a fitted outfit would have an errant pixel from the undershirt/underwear show through the crotch/armpits where the outfit lost pixels due to fitting. Underwear and undershirts now undergo the same pixel fitting as other clothes to ensure this doesn't happen.\r\n\r\n* Automatic changelog generation for PR #55139 [ci skip]\r\n\r\n* Automatic changelog compile, [ci skip]\r\n\r\n* Updated strip menus (#55094)\r\n\r\nPartiallyfixes #34369\r\n\r\nModified xenomorph, monkey, dog, and parrot strip menu UI to be like humanoids'. Also fixed an issue with parrot strip menu where it wouldn't refresh once you removed its headset, and fixed an inconsistency where human handcuff/legcuff removal buttons were different.\r\n\r\n* Automatic changelog generation for PR #55094 [ci skip]\r\n\r\n* Fixes incapacitating sleep test failure, general test touch ups. (#55196)\r\n\r\nFixes the random incapacitating sleep test failure\r\nTests now provide the option to use a custom turf, by default uses plasteel tiles instead of space\r\nTests now reserve turf instead of just using a corner in CentCom (which had unaccounted for tiles)\r\n\r\n* Working on unit test related issues grants 6 GBP, automatically add tag (#55199)\r\n\r\nUnit tests (a label I recently added) will now give 6 GBP. This label should be added to anything that adds a new unit test, even on features.\r\n\r\n* Makes swarmers and morphs ghost-visible in the orbit menu (#55191)\r\n\r\nMakes Morphs and Swarmers have their own part of the orbit menu, like other visible antagonists. Given pretty much every other ghost-obvious antagonist is, it's more of an oversight that you couldn't.\r\n\r\n* Automatic changelog generation for PR #55191 [ci skip]\r\n\r\n* HFR runtime fix (#55189)\r\n\r\n* Automatic changelog generation for PR #55189 [ci skip]\r\n\r\n* Fixes improvised jetpacks working as infinite one tick boosters (#55202)\r\n\r\nFixes improvised jetpacks working as infinite one tick boosters\r\nallow_thrust is used as a check when the jetpack is toggled on to see if it should be allowed to turn on. This line needs to return the parent call instead of presuming it passes.\r\n\r\n* Automatic changelog generation for PR #55202 [ci skip]\r\n\r\n* Proto Nitrate reaction fix (#55188)\r\n\r\nFix runtime with proto_nitrate reaction with trit\r\n\r\n* Automatic changelog generation for PR #55188 [ci skip]\r\n\r\n* fixes ageusia (#55187)\r\n\r\n* Automatic changelog generation for PR #55187 [ci skip]\r\n\r\n* recolored skeleton sprites (#55185)\r\n\r\nskeletons no longer have eye sprites\r\ni recolored skeleton sprites a bit\r\n\r\n* Automatic changelog generation for PR #55185 [ci skip]\r\n\r\n* Changes grenade proc names to be more clear (#55181)\r\n\r\nGrenades have, for the longest time, used the proc name preprime() to refer to arming a timed grenade so that it will boom in a few seconds, and prime() to refer to the grenade actually going boom (or releasing foam or anything else grenades do when they go off). This was very confusing, so now these two procs are called arm_grenade() and detonate().\r\n\r\n* Fixes Ghost Dynamic Abductors (#55176)\r\n\r\nFixes an issue where an abductor team was created every time a midround antagonist was created by Dynamic, even if it wasn't Abductors. This was simply due to some misplaced code.\r\n\r\n* Automatic changelog generation for PR #55176 [ci skip]\r\n\r\n* adds broken states to grass (#55108)\r\n\r\ngrass now gets baseturfs\r\nadds a damaged icon for sand\r\n\r\n* Automatic changelog generation for PR #55108 [ci skip]\r\n\r\n* Mech Ammo now properly respects ammo for custom materials. (#55095)\r\n\r\nMech code now does a basic check for the amount of remaining ammo to adjust the amount of custom materials of an ammo container based on the remaining ammo against the original amount of ammo.\r\nWhen the ammo runs out, it's hard-set to 2000 iron as that's the value of the sheet of iron that it gets set to by the end.\r\n\r\n* Automatic changelog generation for PR #55095 [ci skip]\r\n\r\n* taming improvements (#55086)\r\n\r\ntame var is now set to true on the tamed proc, not right before the tamed proc in feeding proc so if an admin atom proc calls tamed the mob is tamed\r\nvatbeast no longer overrides its faction to neutral because it already sets the action to the tamer's\r\n\r\n* Automatic changelog generation for PR #55086 [ci skip]\r\n\r\n* Hauberoach's now properly give correct feedback if you're immune to their headspike. (#55079)\r\n\r\nHauberoaches now give a different, clearer line of dialog when stepped on by a pierce immune carbon mob.\r\n\r\n* Automatic changelog generation for PR #55079 [ci skip]\r\n\r\n* Remove duplicate definitions of /obj/effect/ex_act, explicitly noop it (#55076)\r\n\r\n/obj/effect/ex_act had several different re-definitions to make it a noop. The original definition would randomly delete it, which is bad news when a lot of /obj/effects are just that--effects, that shouldn't be blown up.\r\n\r\nThe ones that actually do want to be blown up (like decals) already have their own implementations. The one in place was never ran, and nobody had problems with it.\r\n\r\n* Fixes Issues Regarding Finding Spider and Swarmer Spawns (#55054)\r\n\r\nThis PR fixes the issue where people couldn't teleport to spider egg clusters using the notification.\r\n\r\nIt also adds both the swarmer beacon and spider egg clusters to the ghost orbit menu. This should make it easier to find instances of both in cases where a player might miss the initial notification.\r\n\r\n* Automatic changelog generation for PR #55054 [ci skip]\r\n\r\n* Fixing robot upgrades sometimes not being removed from lists. (#54842)\r\n\r\n* APC Fixes Pt. 1: Standardizes MetaStation APCs (#55060)\r\n\r\n* add showers to icebox and pubby atmos (#55190)\r\n\r\n* Automatic changelog generation for PR #55190 [ci skip]\r\n\r\n* Fixed cooling in the IceBox RD Server Room (#54998)\r\n\r\n* More Map Fixes (#55204)\r\n\r\n* fix pubby's incinerator errors, fix atmospheric testing room space walls\r\n\r\n* double lattice\r\n\r\n* Automatic changelog generation for PR #55204 [ci skip]\r\n\r\n* Adds N2 Canisters to the Delta Supermatter (#55205)\r\n\r\n* Does the Thing\r\n\r\n* Removes delta rad collector subtype\r\n\r\nCo-authored-by: Coffee <crashkray@gmail.coom>\r\n\r\n* Automatic changelog generation for PR #55205 [ci skip]\r\n\r\n* Automatic changelog compile, [ci skip]\r\n\r\n* Feex (#55228)\r\n\r\nMissing ! meant that if an upgrade was unequippable, it would be installable. If it wasn't unequippable, it wouldn't be installable. This is fixed.\r\n\r\nNo reason I can see for cyborg upgrades to pass through the attack chain if they fail to get installed in general. Most other things stop immediately if they fail. Removed ugly if-then-else chain as a result. I'm sure someone will correct me if I'm wrong on this, it's 2:15am and I want to sleep.\r\n\r\n(Note from lemon: the logic was quite literally backwards, I am depressed)\r\n\r\n* Automatic changelog generation for PR #55228 [ci skip]\r\n\r\n* Kills the quickswap shortcut (#55209)\r\n\r\n* Automatic changelog generation for PR #55209 [ci skip]\r\n\r\n* the flight plans filed with the agency lists etc etc (#55214)\r\n\r\nSomeone reported an issue on the discord where, since BYOS shuttles now have shuttle computers, they can now be hijacked partially or completely before it's actually time for evac. This has been confirmed as unintended behavior by anne, who submitted the hijack rework port, so this PR fixes that by requiring the shuttle to have at least \"docked\" before the ability to hijack it is available\r\n\r\n* Automatic changelog generation for PR #55214 [ci skip]\r\n\r\n* Allows dynamic game modes to be disabled (#55200)\r\n\r\nCurrently for headmins to disable game modes they need to set the list of valid threats to 101, counting on the fact that the threat level doesn't go higher than 100.\r\nThis is brittle, bypasses checks for having enough valid game modes, and a hacky solution at best.\r\n\r\nMade it so that setting the weight of a ruleset set to zero, be it via configs or by var-editing, will no longer draft it for picking, effectively disabling it.\r\n\r\n* sstimer no longer batches maintenance tasks to the bucket list to avoid edge cases and duplicated logic. (#55140)\r\n\r\n* sstimer no longer delays maintenance tasks if its going over its tick.\r\n\r\nThis was leading to bugs if certain state operations happened while a task was delayed, furthermore if the timer subsystem was overloaded, the invoked timers list would bloat as it would never get cleared out, which would make all timer invocations take longer as they had to add to an ever growing list.\r\n\r\n* Update timer.dm\r\n\r\n* Fix error when a bucket has only one timer.\r\n\r\n* simply timer loop logic & improve timer debug string\r\n\r\nIt would try to batch up linked list modifications and every issue we have ever had has been related to this, so now it just directly pulls the head of the linked list off, using bucketEject, rather then detect when it reaches the end of the linked list queue it will now just know because the bucket will be empty.\r\n\r\nAll bucketCount logic has been moved to bucketEject and bucketJoin(), which should also keep that more proper.\r\n\r\n* Update timer.dm\r\n\r\n* Update timer.dm\r\n\r\n* Changes the discord verify command from .verify to ?verify \r\n\r\nThis stops it conflicting with an existing set of commands that are for fun usage\r\n\r\n* Automatic changelog generation for PR #55212 [ci skip]\r\n\r\n* Automatic changelog compile, [ci skip]\r\n\r\n* Update links to Yarn documentation (#55235)\r\n\r\nUpdates tgui documentation to show that yarn berry (v2) is now used.\r\n\r\nCo-authored-by: oranges <email@oranges.net.nz>\r\nCo-authored-by: Aleksej Komarov <stylemistake@gmail.com>\r\n\r\n* Adds 3 periods to the game (#55243)\r\n\r\nFixes a single typo\r\n\r\n* Automatic changelog generation for PR #55243 [ci skip]\r\n\r\n* Cryopod cooling fix for humans (#55221)\r\n\r\nThe core temp was meant to be cooled separately through the skin in cryo pods, but on inspection that interaction was skipped.\r\nThis makes the core temp match skin temp in a cryo pod.\r\n\r\n* Automatic changelog generation for PR #55221 [ci skip]\r\n\r\n* Tweaks to temperature code (#55216)\r\n\r\nThis is a small tweak that makes skin temp raise up faster when cold in response to ice moon being harder.\r\nThis also makes a change to mobs in statis beds no long hold bed temp in some quantum lock but stops the natural stabilization. This means that is you put a frozen/superheated mob on the floor or a statis bed they will balance tot the room temp over time. The mob is not physically separate from the room in a statis bed and all life functions are still suspended.\r\n\r\n* Automatic changelog generation for PR #55216 [ci skip]\r\n\r\n* Automatic changelog compile, [ci skip]\r\n\r\n* Add AnturK's 'GC Issues' guide\r\n\r\n* Add Mothblocks's unit test documentation and guide\r\n\r\n* Add \"Important Types\" info from neersighted's \"Common Variables and Functions\"\r\n\r\n* Add some method descriptions from neer's \"Common Variables and Functions\"\r\n\r\n* Add dmdocs to /proc/getline\r\n\r\n* Correct some links and formatting in CONTRIBUTING\r\n\r\n* Fixes custom double-barreled shotgun back sprites (#55232)\r\n\r\nThe custom double-barrelled shotgun sprite names contained a hyphen instead of an underscore, making them appear as error sprites when worn.\r\n\r\n* Automatic changelog generation for PR #55232 [ci skip]\r\n\r\n* tgui: Round Gauge (#55230)\r\n\r\nThis PR introduces the wacky round gauge for showing all of your favourite metrics in half-circle format. Show off those wacky numbers, use some scary blinking lights, feel alive!\r\n\r\nI've also gone ahead and included this in the canister and tank (think internals) UIs. I've also done some refactoring of data sending from canisters because GOSH DANG it required some.\r\n\r\n* Automatic changelog generation for PR #55230 [ci skip]\r\n\r\n* Sets default food size to small. (#55210)\r\n\r\n## About The Pull Request\r\n\r\nFixes an oversight done during the food refactor that makes all food items normal sized instead of small.\r\nInstead of adding weight class to a bunch of individual items [(like this PR)](https://github.com/tgstation/tgstation/pull/55174) it just makes all food default to small unless tagged to be bigger.\r\n\r\n## Why It's Good For The Game\r\n\r\nBeing able to put 7 items on a tray instead of 4 is good, and if a food item is \"too powerful\", that individual item (or subtype, such as soups) can be given a larger weight class.\r\n\r\nFixes #54818\r\n\r\n* Automatic changelog generation for PR #55210 [ci skip]\r\n\r\n* Small refactor for medical stack items (#55213)\r\n\r\nSomeone DM'd me asking a question about what the 'heal' var was for on aloe, I looked into it and realized it was an unnecessary variable that just replicated what heal_brute and heal_burn do. I then realized there was quite a lot of unnecessary copypasta in medical stack code, so I made some changes to make it neater and added some documentation in to boot\r\n\r\n* More HFR fixes (#55203)\r\n\r\n- Refractor HFR core from binary device to unary device to fix issue with cooling not properly connecting, that was deleting gases when tryed to use (only one port cooling now similar to a Thermomachine)\r\n- Small fix of GUI data where two vars were inverted\r\n\r\n* Automatic changelog generation for PR #55203 [ci skip]\r\n\r\n* Removed jQuery from snowflake devices (#55090)\r\n\r\n* Removed jQuery from snowflake menus\r\n\r\n* Update code/modules/admin/verbs/beakerpanel.dm\r\n\r\nCo-authored-by: Kyle Spier-Swenson <kyleshome@gmail.com>\r\n\r\nCo-authored-by: Kyle Spier-Swenson <kyleshome@gmail.com>\r\n\r\n* Automatic changelog generation for PR #55090 [ci skip]\r\n\r\n* Fix the implosion compressor runtiming when the bomb is too weak (#55231)\r\n\r\nPreviously, the implosion compressor would runtime when the bomb was too weak due to a badly ordered QDEL_NULL. Now, it properly returns the message.\r\n\r\n* Automatic changelog generation for PR #55231 [ci skip]\r\n\r\n* Fixes oversight where pAIs are not able to select headset radio channels from encryption keys (#55215)\r\n\r\npAI integrated headsets are the only headsets that don't have `subspace_transmission = TRUE` - Ordinarily they're not able to install encryption keys, so this isn't necessary or useful to them.\r\n\r\nHowever, selecting departmental channels based on the installed encryption key is a function locked behind `subspace_transmission = TRUE` and I think the fact this flag isn't set when the pAI installs its encryption keys upgrade is most likely an oversight.\r\n\r\nThis should fix all issues where pAIs get fancy encryption keys like Captain ones, but are unable to utilise any frequencies except the default ones that come pre-enabled (such as the Cap key coming with only Sec/Command enabled and having all others disabled).\r\n\r\n* Automatic changelog generation for PR #55215 [ci skip]\r\n\r\n* make gas selling use elasticity (#55192)\r\n\r\nFix gas selling never use diminishing returns\r\n\r\n* Automatic changelog generation for PR #55192 [ci skip]\r\n\r\n* Grep for space indentation (#54850)\r\n\r\n#54604 atomizing\r\nSince a lot of the space indents are in lists ill atomize those later\r\n\r\n* Makes the usage of force_threshold in the attackby() proc for simplemobs consistent with the way it's used everywhere else (#55023)\r\n\r\n## About The Pull Request\r\n\r\nNamely, this means that a simplemob's immunity to melee attacks of force X or lower now accounts for that simplemobs damage multipliers to various damage types. It also means that simplemobs with a force_threshold of X are now immune to melee attacks of force X or lower, not melee attacks with a force less than X (<= vs. <).\r\n\r\n## Why It's Good For The Game\r\n\r\n**tldr;\r\nThis make the code for simplemob \"your stick must be this strong to deal damage\" thresholds more consistent.**\r\n\r\nXenomorphs, xenomorph larvae, barehanded monkeys, slimes, and simplemobs in general all multiply the damage of their attacks by the relevant damage resistance multiplier BEFORE checking it against the force_threshold of the simplemob they're attacking, and also check to see if their damage is <= the force_threshold of the simplemob they're attacking (instead of requiring it to be strictly < the force_threshold of the simplemob they're attacking).\r\n\r\nAs for balance concerns, while this will affect juggernauts *slightly* (as they'll now be immune to force <= 10 melee weapons instead of just force < 10 melee weapons), I'm not too worried about that. What I _am_ worried about is blobbernauts, who, after this change, will be immune to brute melee weapons of force 20 or lower (due to their 0.5 brute damage multiplier). You will, of course, still be able to welder them just as effectively as you could before, but I'm worried that this could make blob-aligned blobbernauts even stronger than they already are.\r\n\r\n* Automatic changelog generation for PR #55023 [ci skip]\r\n\r\n* grep for pixelx/y = 0 varedits (#54845)\r\n\r\nCo-authored-by: Jordan Brown <Cyberboss@users.noreply.github.com>\r\n\r\n* Fixes Nar'Sie rune erasing bug (#55123)\r\n\r\n* Automatic changelog generation for PR #55123 [ci skip]\r\n\r\n* Init sanity unit test (#55147)\r\n\r\nhttps://github.com/tgstation/TerraGov-Marine-Corps/pull/5326\r\nStemming from \r\nhttps://github.com/ParadiseSS13/Paradise/pull/14770\r\n\r\nBasically it just checks for bad initialize calls\r\n\r\n* Automatic changelog compile, [ci skip]\r\n\r\n* Remove redundant triple-backticks\r\n\r\n* Add a table of contents to CONTRIBUTING.md\r\n\r\n* Move Maintainer and Issue Manager guidelines into CONTRIBUTING\r\n\r\n* Update TGS DMAPI (#55259)\r\n\r\nCo-authored-by: tgstation-server <tgstation-server@users.noreply.github.com>\r\n\r\n* Slightly edit CONTRIBUTING\r\n\r\n* Single-space the /obj/item/proc/equipped docblock\r\n\r\n* Use block comments for get_turf and get_area\r\n\r\n* Use block comments for do_after and getline\r\n\r\n* Revert \"Update TGS DMAPI (#55259)\" (#55271)\r\n\r\nThis reverts commit d2454ee42db8ee3fc4935959ca2a0dcf88b10a18.\r\n\r\n* Luxury shuttle scanner gate bugfixes and improvements (#55107)\r\n\r\nOh man this one took me a hot second.\r\nLuxury Shuttle gates now do the following:\r\n\r\nRespect simplemobs dragging through credits so they can be considered legitimate passengers.\r\n\r\nRespect vehicles and by proxy mechs so that you don't block the narrow causway into the shuttle. Entering the gate with cash will add both yourself and the vehicle to the whitelist. Entering the gate in a whitelisted vehicle, but without paying yet will throw angry buzzing at you as expected.\r\n\r\nThe shuttle will only take the correct credit count now, or at least provide the correct change.\r\n\r\nThe scanner is now invincible as it LITERALLY only exists on a roundend shuttle.\r\n\r\n* Automatic changelog generation for PR #55107 [ci skip]\r\n\r\n* unfucks hitting simplemobs with melee attacks (sorry!) (#55269)\r\n\r\nAdds a single \"!\" to the code I added (in #55023) to make it not make most simplemobs immune to being hit with most melee weapons.\r\n\r\n* Automatic changelog generation for PR #55269 [ci skip]\r\n\r\n* Ports custom food to new food datum (#55207)\r\n\r\nCo-authored-by: Bobbahbrown <bobbahbrown@gmail.com>\r\nCo-authored-by: Jared-Fogle <35135081+Jared-Fogle@users.noreply.github.com>\r\n\r\n* Automatic changelog generation for PR #55207 [ci skip]\r\n\r\n* Maybe fixes DMAPI Update PR not triggering actions (#55297)\r\n\r\n* Revert \"Removed jQuery from snowflake devices\" (#55272)\r\n\r\n* Revert \"Removed jQuery from snowflake devices (#55090)\"\r\n\r\nThis reverts commit ee47cb5289b688b4a902e305d798cc500f098bd8.\r\n\r\n* linting SUCKS\r\n\r\n* Fixes detdrobe construction bug (#55264)\r\n\r\nLets detectives disassemble their vendor to restock it I guess.\r\nThey could rebuild it if someone else broke in and took it apart too?\r\n\r\n* Automatic changelog generation for PR #55264 [ci skip]\r\n\r\n* Make unit tests visible to linter and IDE (#55270)\r\n\r\n* Fixes newfood reagent transfer and food trash' to_chat (#55150)\r\n\r\nCo-authored-by: Jared-Fogle <35135081+Jared-Fogle@users.noreply.github.com>\r\n\r\n* Automatic changelog generation for PR #55150 [ci skip]\r\n\r\n* You can('t) whisper into comms in crit. (#54970)\r\n\r\n* Stops critted people from speaking into the radio.\r\n\r\n* Whitelist implementation and removal of unreachable/unused code.\r\n\r\n* Woops.\r\n\r\n* Automatic changelog generation for PR #54970 [ci skip]\r\n\r\n* Calms down the linter. (#55312)\r\n\r\n* Makes fearless trait affect social anxiety (#55284)\r\n\r\nAn oversight from when I added psicodine and happiness\r\n\r\n* Automatic changelog generation for PR #55284 [ci skip]\r\n\r\n* Fixes perspective of mood messages (#55290)\r\n\r\n* Automatic changelog generation for PR #55290 [ci skip]\r\n\r\n* Fixes new players harddeling when the player logs out (#55295)\r\n\r\n* Fixes the lipstick sprites (#55281)\r\n\r\n* Extends the IC chat filter to be checked in two major renaming procs (#55217)\r\n\r\nAbout The Pull Request\r\n\r\nHonestly, I'm not sure this is the... Correct solution? But people more familiar with this will likely show me da wae.\r\n\r\nProhibits creating names that can't actually be spoken in-character due to chat filters by adding CHAT_FILTER_CHECKs to the procs that handle sanitising them.\r\n\r\nFor admin-utilised renaming procs, they'll be given a simple alert box to warn them their chosen name contains words prohibited by the IC chat filter and be allowed to confirm or cancel out.\r\nWhy It's Good For The Game\r\n\r\nIf you can't speak the name IC, chances are the name shouldn't be allowed at all. Players may occasionally be forced to ahelp certain names because they contain words prohibited in chat filters.\r\n\r\n* Automatic changelog generation for PR #55217 [ci skip]\r\n\r\n* 'cause it shouldn't happen (#55288)\r\n\r\n* Automatic changelog generation for PR #55288 [ci skip]\r\n\r\n* Automatic changelog compile, [ci skip]\r\n\r\n* new dark gygax sprites (cool and edgy) (#55293)\r\n\r\nnew dark gygax sprites\r\n\r\n* Automatic changelog generation for PR #55293 [ci skip]\r\n\r\n* Update TGS DMAPI (#55323)\r\n\r\nCo-authored-by: tgstation-server <tgstation-server@users.noreply.github.com>\r\n\r\n* Automatic changelog compile, [ci skip]\r\n\r\n* Adds amputation shear suicide (#55308)\r\n\r\n* part 1\r\n\r\n* now works\r\n\r\n* uhhuh\r\n\r\n* and i oop\r\n\r\n* snip snip\r\n\r\n* SNIP SNIP\r\n\r\nCo-authored-by: Coffee <crashkray@gmail.coom>\r\n\r\n* Automatic changelog generation for PR #55308 [ci skip]\r\n\r\n* Fixes borg upgrades with action buttons being broken (#55305)\r\n\r\nFixes #55257\r\nYou can probably also currently install upgrades somehow stuck to your hand, and if so this would also fix that.\r\n\r\n* Automatic changelog generation for PR #55305 [ci skip]\r\n\r\n* Automatic changelog compile, [ci skip]\r\n\r\n* Automatic changelog compile, [ci skip]\r\n\r\n* fixes nanodrug unused sprite (#55300)\r\n\r\nNanoDrug Plus has a distinct sprite to NanoMed Plus. It isn't used. This uses it.\r\n\r\n* Automatic changelog generation for PR #55300 [ci skip]\r\n\r\n* Make RCD suicide place wall and gib user (#55283)\r\n\r\n* Make RCD suicide place wall\r\n\r\n* gibbing should return MANUAL_SUICIDE\r\n\r\n* return SHAME if no ammo\r\n\r\n* Only set RCD to wall if the message says so\r\n\r\n* Automatic changelog generation for PR #55283 [ci skip]\r\n\r\nCo-authored-by: tgstation-server <tgstation-server@tgstation13.org>\r\nCo-authored-by: ArcaneMusic <41715314+ArcaneMusic@users.noreply.github.com>\r\nCo-authored-by: Fikou <piotrbryla@onet.pl>\r\nCo-authored-by: Maurukas <66576896+Maurukas@users.noreply.github.com>\r\nCo-authored-by: Jared-Fogle <35135081+Jared-Fogle@users.noreply.github.com>\r\nCo-authored-by: Qustinnus <Floydje123@hotmail.com>\r\nCo-authored-by: Changelogs <action@github.com>\r\nCo-authored-by: Ryll Ryll <3589655+Ryll-Ryll@users.noreply.github.com>\r\nCo-authored-by: Jordan Brown <Cyberboss@users.noreply.github.com>\r\nCo-authored-by: spookydonut <github@spooksoftware.com>\r\nCo-authored-by: cacogen <25089914+cacogen@users.noreply.github.com>\r\nCo-authored-by: ArcaneDefence <51932756+ArcaneDefence@users.noreply.github.com>\r\nCo-authored-by: prodirus <44090982+prodirus@users.noreply.github.com>\r\nCo-authored-by: Ghom <42542238+Ghommie@users.noreply.github.com>\r\nCo-authored-by: zxaber <37497534+zxaber@users.noreply.github.com>\r\nCo-authored-by: Bond <58570888+TheBonded@users.noreply.github.com>\r\nCo-authored-by: antropod <antropod@gmail.com>\r\nCo-authored-by: Yenwodyah <yenwodyah@gmail.com>\r\nCo-authored-by: ATH1909 <42606352+ATH1909@users.noreply.github.com>\r\nCo-authored-by: Timberpoes <silent_insomnia_pp@hotmail.co.uk>\r\nCo-authored-by: Arkatos1 <43862960+Arkatos1@users.noreply.github.com>\r\nCo-authored-by: Aleksej Komarov <stylemistake@gmail.com>\r\nCo-authored-by: Coffee <CoffeeDragon16@gmail.com>\r\nCo-authored-by: itseasytosee <55666666+itseasytosee@users.noreply.github.com>\r\nCo-authored-by: NightRed <nightred@gmail.com>\r\nCo-authored-by: Bobbahbrown <bobbahbrown@gmail.com>\r\nCo-authored-by: TemporalOroboros <TemporalOroboros@gmail.com>\r\nCo-authored-by: MrMelbert <51863163+MrMelbert@users.noreply.github.com>\r\nCo-authored-by: skoglol <33292112+kriskog@users.noreply.github.com>\r\nCo-authored-by: LordVollkorn <66637090+LordVollkorn@users.noreply.github.com>\r\nCo-authored-by: LemonInTheDark <58055496+LemonInTheDark@users.noreply.github.com>\r\nCo-authored-by: tattlemothe <66640614+dragomagol@users.noreply.github.com>\r\nCo-authored-by: Ghilker <42839747+Ghilker@users.noreply.github.com>\r\nCo-authored-by: IndieanaJones <47086570+IndieanaJones@users.noreply.github.com>\r\nCo-authored-by: Cartographer-D <63861499+Cartographer-D@users.noreply.github.com>\r\nCo-authored-by: Josh <josh@jaw.sh>\r\nCo-authored-by: Coffee <crashkray@gmail.coom>\r\nCo-authored-by: Rohesie <rohesie@gmail.com>\r\nCo-authored-by: Kyle Spier-Swenson <kyleshome@gmail.com>\r\nCo-authored-by: Mordent <62817778+mordent-goonstation@users.noreply.github.com>\r\nCo-authored-by: oranges <email@oranges.net.nz>\r\nCo-authored-by: Tad Hardesty <tad@platymuus.com>\r\nCo-authored-by: Winter Flare <7543955+Owai-Seek@users.noreply.github.com>\r\nCo-authored-by: WarlockD <warlockd@gmail.com>\r\nCo-authored-by: TiviPlus <57223640+TiviPlus@users.noreply.github.com>\r\nCo-authored-by: github-actions[bot] <41898282+github-actions[bot]@users.noreply.github.com>\r\nCo-authored-by: tgstation-server <tgstation-server@users.noreply.github.com>\r\nCo-authored-by: Jack LeCroy <3073035+jacklecroy@users.noreply.github.com>\r\nCo-authored-by: AnturK <AnturK@users.noreply.github.com>\r\nCo-authored-by: Mickyan <38563876+Mickyan@users.noreply.github.com>\r\nCo-authored-by: Tom <tomforde4@gmail.com>\r\nCo-authored-by: sergeirocks100 <31294280+sergeirocks100@users.noreply.github.com>\r\nCo-authored-by: Urumasi <Urumasi@email.cz>","tree":{"sha":"e53b218929d0cce8c637d70375f44ce810100e96","url":"https://api.github.com/repos/MMMiracles/tgstation/git/trees/e53b218929d0cce8c637d70375f44ce810100e96"},"url":"https://api.github.com/repos/MMMiracles/tgstation/git/commits/cf84297c3574ccd375ab24a9379199e2f66421fc","comment_count":0,"verification":{"verified":true,"reason":"valid","signature":"-----BEGIN PGP SIGNATURE-----\n\nwsBcBAABCAAQBQJfycECCRBK7hj4Ov3rIwAAdHIIAGYn/KaTNgQ/TyGE3EP9/PuO\nECUi6wVsP8sg9nGu8UQKnmmcqEPvo6nf2QVMhpHYCxinLFSquqnViqsfhrCHe3Kh\nytvSNoUY4nZl5e+OwjnM+KFY4IYXmcW785KIW2/1IHahl55cIZMODx/RYrxW1tWI\nNSthUpSrnbs20826VSS7DgLYzBKNAzvoV304YxsTwpY4s6y1JKEZSdqoYWKfP+Wi\n47G8Css1nwVw6385NDrXROaSDfEo9dzboS7U/xkbiZgR57ZOVLsrgSfyHV105kXi\nSUXbP8FJOIL/ULgYJxiGPX/RdxxKO9bwhk4itNy+9HebLlATHgHyb389G5JmftU=\n=EiDG\n-----END PGP SIGNATURE-----\n","payload":"tree e53b218929d0cce8c637d70375f44ce810100e96\nparent 05971b811f5e5e10c825fc4c6bcb8e2c442ea8ca\nauthor MMMiracles <lolaccount1@hotmail.com> 1607057666 -0500\ncommitter GitHub <noreply@github.com> 1607057666 -0500\n\nme updating my fork (#1)\n\n* Automatic changelog generation for PR #54783 [ci skip]\r\n\r\n* Makes it so living crate creatures can pass plastic flaps as god intended. (#55088)\r\n\r\n* Automatic changelog generation for PR #55088 [ci skip]\r\n\r\n* improves away missions and load times (#55055)\r\n\r\n* improves away missions and load times\r\n\r\n* snowed inn\r\n\r\n* Automatic changelog generation for PR #55055 [ci skip]\r\n\r\n* Fixes cryogenics infinite gas deletion (#55068)\r\n\r\n* cryo fixes and cleanup\r\n\r\nMove magic numbers to defines\r\nFixes cryo deleting 100L of gas each time it transfers\r\nRemove unneeded/unused variables\r\nMoves gas all gas consumption to process_atmos\r\ndelta_time in process_atmos\r\n\r\n* simplify consume_gas\r\n\r\n* Automatic changelog generation for PR #55068 [ci skip]\r\n\r\n* Hygienebots de/construct and behave like the other simplebots. (#55089)\r\n\r\nAdds simple deconstruct steps to the hygiene bot assembly, as well as adds a simple crafting menu option to craft one.\r\nAlso, corrects an issue with hygienebots not needing to be opened in order to be emagged. They now need to be emagged to be opened with a screwdriver, then emag the open panel in order to emag the robot, just like every other robot.\r\n\r\n* Automatic changelog generation for PR #55089 [ci skip]\r\n\r\n* Reload verbs when the client goes into a new mob (#55106)\r\n\r\nTry this experiment at home:\r\n\r\n    1.Ctrl shift click your ghost\r\n    2.Notice that you still have the Ghost tabs, and you don't see OOC > Ghost, uh oh.\r\n\r\nThis happens for more than ctrl-shift-clicking, it happens a lot with event mobs.\r\n\r\nThis reloads verbs on /mob/Login, aka when the client goes into a new mob (or when they reconnect).\r\n\r\n* Automatic changelog generation for PR #55106 [ci skip]\r\n\r\n* Moves grown food to newfood (#55040)\r\n\r\nMoves grown food to newfood\r\nGives trash element support for callbacks for item creation override\r\n\r\n* Automatic changelog generation for PR #55040 [ci skip]\r\n\r\n* shuttle catastrophe now cant trigger if it already happened (#55114)\r\n\r\nShuttle catastrophe now cant trigger if it already happened\r\n\r\n* Automatic changelog generation for PR #55114 [ci skip]\r\n\r\n* Automatic changelog compile [ci skip]\r\n\r\n* Foam darts and other unembeddable bullets will no longer leave ghost shrapnel (#54994)\r\n\r\nProjectiles are assigned the ability to try embedding by the presence of a shrapnel_type variable being set on them, whether or not they actually have a set of embedding stats in their embedding var. By default, children of /obj/projectile/bullet have a shrapnel type set to a generic embedded bullet item, including things like foam darts and lollypop projectiles which shouldn't be able to embed (and certainly not embed as a bullet). While they had their embedding vars set to null, they still had their shrapnel_type set to the embedded bullet type, meaning shooting a person with a dart gun or whatever would leave a failed shrapnel item on the ground where they weren't supposed to.\r\n\r\nThis fixes that by requiring both a defined shrapnel_type AND a defined embedding var for the embedding stats. Any projectiles without both won't be able to try embedding. I also manually put 'shrapnel_type = null' on any bullet subtypes with embedding = null just to be safe and for consistency.\r\n\r\n* Automatic changelog generation for PR #54994 [ci skip]\r\n\r\n* Automatic changelog compile, [ci skip]\r\n\r\n* removes a direct use of Destroy() (#55043)\r\n\r\n* cursed\r\n\r\n* Update code/datums/mutations/antenna.dm\r\n\r\nCo-authored-by: Jordan Brown <Cyberboss@users.noreply.github.com>\r\n\r\n* Update code/datums/mutations/antenna.dm\r\n\r\nCo-authored-by: spookydonut <github@spooksoftware.com>\r\n\r\n* Update code/datums/mutations/antenna.dm\r\n\r\nCo-authored-by: spookydonut <github@spooksoftware.com>\r\n\r\nCo-authored-by: Jordan Brown <Cyberboss@users.noreply.github.com>\r\nCo-authored-by: spookydonut <github@spooksoftware.com>\r\n\r\n* Automatic changelog generation for PR #55043 [ci skip]\r\n\r\n* additions no longer runtime on medical kiosks. (#55125)\r\n\r\n* UNIQUE_RENAME respects labels (#55121)\r\n\r\n* Automatic changelog generation for PR #55121 [ci skip]\r\n\r\n* path funeneee (#55119)\r\n\r\n* Automatic changelog generation for PR #55119 [ci skip]\r\n\r\n* Lowers Stasis Bed Overlay below objects to prevent overlay issues. (#55082)\r\n\r\n* Automatic changelog generation for PR #55082 [ci skip]\r\n\r\n* one character fix (#55067)\r\n\r\n* Automatic changelog generation for PR #55067 [ci skip]\r\n\r\n* Fixing the point emote being both usable and unusable (#55063)\r\n\r\n* Automatic changelog generation for PR #55063 [ci skip]\r\n\r\n* Fixes tool implant tools being storable in boxes (#54914)\r\n\r\n* Moves storing tool implant items to use the drop hotkey rather than a dropped item event\r\n\r\n* de-debugging\r\n\r\n* Automatic changelog generation for PR #54914 [ci skip]\r\n\r\n* Makes APCs not cause runtimes when placed in space (#55045)\r\n\r\n* Automatic changelog generation for PR #55045 [ci skip]\r\n\r\n* This makes me sad (#55007)\r\n\r\n* Automatic changelog generation for PR #55007 [ci skip]\r\n\r\n* Detect if ghost reentered the brain (#54975)\r\n\r\n* Automatic changelog generation for PR #54975 [ci skip]\r\n\r\n* make sure slowdown effects get removed when items are unequipped (#54947)\r\n\r\n* Fixes PDA bombing have equal chances to work on PDAs without manifest access vs PDAs with it (#55036)\r\n\r\n* Makes extra difficulty actually work\r\n\r\n0\r\n\r\n* Actually fixes it as of what Fikou suggested\r\n\r\n* no space, sorry\r\n\r\nCo-authored-by: ATH1909 <42606352+ATH1909@users.noreply.github.com>\r\n\r\nCo-authored-by: ATH1909 <42606352+ATH1909@users.noreply.github.com>\r\n\r\n* Automatic changelog generation for PR #55036 [ci skip]\r\n\r\n* Deconstructed computer consoles no longer delete their own circuits. (#55126)\r\n\r\n* Feex\r\n\r\n* Remove newline\r\n\r\n* Automatic changelog generation for PR #55126 [ci skip]\r\n\r\n* Fixes dish drives spitting out components on interact. (#55065)\r\n\r\n* stop vomiting components ok mr dishdrive\r\n\r\n* remember to do the dishes!\r\n\r\n* lazyadds and lazylens\r\n\r\n* actually lazy now\r\n\r\n* Automatic changelog generation for PR #55065 [ci skip]\r\n\r\n* man adds a single ? (#55129)\r\n\r\n* Automatic changelog generation for PR #55129 [ci skip]\r\n\r\n* Prevents mecha drills from stacking do_afters on the same target. (#55145)\r\n\r\n* Feex\r\n\r\n* Feex 2.0 Feexlectric Feexaloo\r\n\r\n* Whitespace purge\r\n\r\n* Automatic changelog generation for PR #55145 [ci skip]\r\n\r\n* tgui: Safe (#55109)\r\n\r\nThis PR refactors safes and brings their UI from html to tgui based on the PR above.\r\n\r\nParadise has more features for safes than us, and these features were not ported along to accommodate feature freeze. Only our current safe features settings were refactored, for example number of tumblers stays 2, no extra safe information on examine and safe codes are not generated on paper for command.\r\n\r\nCo-authored-by: Aleksej Komarov <stylemistake@gmail.com>\r\n\r\n* Automatic changelog generation for PR #55109 [ci skip]\r\n\r\n* Fixes lightbulb injections (#55132)\r\n\r\nCo-authored-by: itseasytosee <55666666+itseasytosee@users.noreply.github.com>\r\nCo-authored-by: Jared-Fogle <35135081+Jared-Fogle@users.noreply.github.com>\r\n\r\n* Automatic changelog generation for PR #55132 [ci skip]\r\n\r\n* Fixes #55112 - Swapping items no longer eats things (#55122)\r\n\r\nQuick swapping items no longer hides them in the mobs contents\r\n\r\n* Automatic changelog generation for PR #55122 [ci skip]\r\n\r\n* Automatic changelog compile [ci skip]\r\n\r\n* Refactors Pastries into newfood. (#54996)\r\n\r\nCo-authored-by: Jared-Fogle <35135081+Jared-Fogle@users.noreply.github.com>\r\nCo-authored-by: Floyd <Floydje123@hotmail.com>\r\n\r\n* Automatic changelog generation for PR #54996 [ci skip]\r\n\r\n* Humans have more complicated body temperatures (#54550)\r\n\r\nThis changes how carbon/humans stabilize body temperature, and changes how damage and wounds are applied based on temperature.\r\n\r\nHumans now have a core body temperature along with body temperature. The core temperature is used for natural stabilization and what viruses like fever and shivers target by raising or lowing the core temperature of the mob.\r\nThe standard body temperature still exists and acts exactly the same for most items at this time but is now treated as surface temperature in humans.\r\n\r\nDamage from body temperature for humans is now based on the core temperature instead of body temperature now.\r\nHumans will now receive burn wounds when the body (surface) temperature is to high for to long.\r\n\r\nThis causes you to see alerts for the area temperature before you take damage in most cases improving visibility of dangerous situations.\r\n\r\n* Automatic changelog generation for PR #54550 [ci skip]\r\n\r\n* Fixes chem and addiction scans, null checks for addiction_list (#55105)\r\n\r\nSo #54797 changed addiction_list to instantiate as a null instead of a list. Turns out a few things relied on the list existing!\r\nThings like health analyser/medical kiosk chem and addiction scans broke, and smokers would no longer get addicted!\r\nMade a few places check if addiction_list is null before continuing.\r\n\r\n(Lemon's note, refactored some code to make it cleaner/removed some unneeded loop typechecks)\r\n\r\n* Automatic changelog generation for PR #55105 [ci skip]\r\n\r\n* Moves sorting of crew console listings to clientside + refactors (#55124)\r\n\r\nMoves the sorting of the entries within the crew console to be clientside. There's no reason to have this serverside.\r\n\r\nI've also refactored the UI data code for the crew console in general, reduced code duplication and reduced unnecessary data transfer of nulls.\r\n\r\n* Automatic changelog generation for PR #55124 [ci skip]\r\n\r\n* CanUseTopic() refactor. (#54747)\r\n\r\n* CanUseTopic() refactor.\r\n\r\n* Forgot about default_can_use_topic. Tested and working.\r\n\r\n* Update bin.dm\r\n\r\n* no-nonsense.\r\n\r\n* Automatic changelog generation for PR #54747 [ci skip]\r\n\r\n* tgui: Fix issues detected by SonarQube (#55098)\r\n\r\n* tgui: Fix issues detected by sonarqube\r\n\r\n* MacOS compatibility\r\n\r\n* Rebuild tgui\r\n\r\n* Nerfs GBP gain (#55038)\r\n\r\nBasically no one ever hits the lower limit and people have fucking bank at this point.\r\n\r\n* Replace tgalert with tgui_alert (#55157)\r\n\r\nAdds TGUI-based alerts to replace the old tgalert system. Replaces all uses of tgalert with tgui_alert except for one, the 'Report Issue' button, as people were (understandably) concerned that this button using tgui will prevent a tgui bug from being easily reported.\r\n\r\nThese windows have a nice little progress bar indicator of how much time they have left, and will automatically close themselves after this time elapses.\r\n\r\nCo-authored-by: Aleksej Komarov <stylemistake@gmail.com>\r\n\r\n* Automatic changelog generation for PR #55157 [ci skip]\r\n\r\n* Fixes template use for 'Report Issue' button in-game + show [s] testmerged prs (#55135)\r\n\r\nFixed and improved the bug report template use when the 'Report Issue' button is used in-game. It now uses the correct template location, as well as automatically filling in the round ID and testmerges.\r\n\r\nWe also now show [s] PRs that are testmerged, as ok-d by oranges, as this is an unofficial label that anyone can apply and doesn't necessitate hiding. It also makes debugging rounds where this was present but not reported more difficult.\r\n\r\n* Automatic changelog generation for PR #55135 [ci skip]\r\n\r\n* Feex (#55144)\r\n\r\nFor whatever reason we hardcoded the health value for drills at 200 brute damage before they can gib. 200 brute damage was picked as it was double the max health of /mob/living/carbon/whatever and double the max health was like, the cap on brute damage when someone is really, really, really, really dead.\r\n\r\nEnter simplemobs. Their max health is regularly under 100, which means a hardcoded value of 200 brute damage to trigger gibbing effects is bad. Not that it matters anyway, because simplemobs also brute damage cap at maxHealth instead of maxHealth * 2 so the only simplemobs that could be gibbed by mech drills are those with 200 or more health.\r\n\r\nThis has been changed. Simplemobs now cap out at maxHealth * 2 damage, in line with all other /mob/living while drill code has been changed to check for maxHealth * 2 when gibbing instead of a hardcoded 200.\r\n\r\n* Automatic changelog generation for PR #55144 [ci skip]\r\n\r\n* Automatic changelog compile [ci skip]\r\n\r\n* Fixes cyborgs in general replenishing stack modules from external sources (#54935)\r\n\r\n* Cyborg stack fix\r\n\r\n- Makes cyborgs capable of recycling floor tiles again\r\n\r\n* Touches up module code\r\n\r\n- Makes module code slightly more OOP-compliant\r\n- Speeds up module creation by an imperceptable amount\r\n- Reworks how borg modules handle stacks\r\n\r\n* Automatic changelog generation for PR #54935 [ci skip]\r\n\r\n* Fixing non wiz phased mobs. (#55162)\r\n\r\nWrong proc path, also qdel ref issue for shadow walk holder.\r\nThis will close #55141 and close #55142\r\nfix: Nightmares and some other critters no longer delete themselves once they stop phasing.\r\n\r\n* Automatic changelog generation for PR #55162 [ci skip]\r\n\r\n* Fixes forced speech nanite oversight (#55164)\r\n\r\nAll of the stunning emotes were blacklisted from the forced speech program. However, *faint was not added this to the list, and this is an oversight. This is a simple one line fix to add it to the blacklist.\r\n\r\n* Automatic changelog generation for PR #55164 [ci skip]\r\n\r\n* Accidental Consumption post-food refactor cleanup (#55152)\r\n\r\n    Renames a bunch of vars to be more descriptive\r\n    Removes old references to snacks\r\n    Updates some code slightly\r\n\r\n* Automatic changelog generation for PR #55152 [ci skip]\r\n\r\n* Remove the hyphen from the default value of the github url string (no longer -tg-station) (#55136)\r\n\r\n* Fixes an adminPM dead end eating replies (#55127)\r\n\r\nIf you tried to reply to an admin that had deadminned while you were typing you would get an error and your message was eaten. Now sends to MessageNoRecipient if theres an open ticket, or prints a warning and the message in chat if there isn't.\r\n\r\n* Automatic changelog generation for PR #55127 [ci skip]\r\n\r\n* Fixes picked up bees, again (#55053)\r\n\r\nBees don't actually have a set icon state, their entire existence is their mutable appearance. This creates problems when something checks for the bee's icon state, like mob_holders. So, this PR sets their icon_state to the corresponding base bee icon on initialization. Visually identical to before, because the overlays / mutable appearance covers it, but their icon_state is no longer null.\r\n\r\n* Automatic changelog generation for PR #55053 [ci skip]\r\n\r\n* Pixels peeve about the galaxy suit (#55165)\r\n\r\nAdded a few pixels to the left and right sprites of the galaxy suits.\r\n\r\n* Automatic changelog generation for PR #55165 [ci skip]\r\n\r\n* Fixes some food item sizes (#55174)\r\n\r\n* Automatic changelog generation for PR #55174 [ci skip]\r\n\r\n* tgui: Stacking Machine Console and Safe UI fix (#55171)\r\n\r\nThis PR refactors Stacking Machine Console from using html based UI to tgui with some code cleanup and documentation. Also fixes a bug I noticed when using Stacking Machine Console - some materials could get stuck there if they were number subtypes (for example /obj/item/stack/sheet/metal/twenty), because console did not check for their merge_type for releasing like stacking machine itself does when the sheet is put inside. This is fixed now.\r\n\r\nAlso fixes a small safe UI bug, where some buttons could be hard to press due to the dialer image being too close to the buttons. Bundling this together to prevent merge conflicts with other tgui PRs. Fixes #55169\r\n\r\n* Automatic changelog generation for PR #55171 [ci skip]\r\n\r\n* Merge type variable fixes and unit test (#55173)\r\n\r\nThis PR fixes a case where certain materials caused issues when working with stacking machines, because they did not have set merge_type from the get go, which meant that initial() of that variable returned null.\r\n\r\nTo clarify further - if /obj/item/stack does not have set merge_type, it is generated merge_type upon Initialize(), which is the same as its typepath. For example, currently /obj/item/stack/sheet/bluespace_crystal does not have any merge_type set, and it is given merge_type = /obj/item/stack/sheet/bluespace_crystal upon Initialize(). Each Initialize(). Again and again.\r\n\r\nThere are quite a bit of these cases in the codebase, especially if its some older code. I have gone through them and set all of them their set merge_type, which they would inevitably receive anyway upon initializing and it fixes a bug mentioned above.\r\n\r\nTo prevent this happening again, I have also included unit test to check if merge types are set for stacks, included exceptions are usually abstract paths like /obj/item/stack/sheet/mineral, which contains zero behavior on its own and does not spawn unless done via admin tools.\r\n\r\n* Automatic changelog generation for PR #55173 [ci skip]\r\n\r\n* Being flashed by a portable flasher is now logged (#55137)\r\n\r\nGetting stunned by a portable flasher will now be reflected in your attack logs\r\n\r\n* Fixes Improvised Jetpack (+New custom icons) (#55177)\r\n\r\nThis fixes the improvised jetpack, which currently cannot be activated.\r\nFixed [#50396](https://github.com/tgstation/tgstation/issues/50396)\r\n\r\nThe code change was very minor and everything seems to work properly now.\r\nBonus: New custom icons for this item, better representing what it most likely would look like\r\n\r\n* Automatic changelog generation for PR #55177 [ci skip]\r\n\r\n* Removes a source of ian harddels, keeps mcgruffs bed discription from getting overwritten at roundstart, moves the bed claiming feature to just the dogbed typepath, none of the subtypes, this applies to buckling too (#55158)\r\n\r\nRemoves a source of ian harddels, keeps mcgruff's bed description from getting overwritten at roundstart, moves the bed claiming feature to just the dogbed typepath, blacklisting subtypes. This applies to buckling too.\r\n\r\nThis means that a dogbed can only ever belong to one dog. Fuck you.\r\nRemake of #54892, github doesn't like force pushes, not sure why\r\n\r\n* Automatic changelog generation for PR #55158 [ci skip]\r\n\r\n* Fixes cleric mace handles (#55163)\r\n\r\n* Automatic changelog generation for PR #55163 [ci skip]\r\n\r\n* Fixes male underwear/shirts poking through clothes (#55139)\r\n\r\nWhile investigating a strange intermittent issue with skirts and such randomly losing a pixel in the crotch they weren't supposed to, I found another underwear/undershirt issue. Female characters and plural characters with a female bodytype wearing mens underwear and a fitted outfit would have an errant pixel from the undershirt/underwear show through the crotch/armpits where the outfit lost pixels due to fitting. Underwear and undershirts now undergo the same pixel fitting as other clothes to ensure this doesn't happen.\r\n\r\n* Automatic changelog generation for PR #55139 [ci skip]\r\n\r\n* Automatic changelog compile, [ci skip]\r\n\r\n* Updated strip menus (#55094)\r\n\r\nPartiallyfixes #34369\r\n\r\nModified xenomorph, monkey, dog, and parrot strip menu UI to be like humanoids'. Also fixed an issue with parrot strip menu where it wouldn't refresh once you removed its headset, and fixed an inconsistency where human handcuff/legcuff removal buttons were different.\r\n\r\n* Automatic changelog generation for PR #55094 [ci skip]\r\n\r\n* Fixes incapacitating sleep test failure, general test touch ups. (#55196)\r\n\r\nFixes the random incapacitating sleep test failure\r\nTests now provide the option to use a custom turf, by default uses plasteel tiles instead of space\r\nTests now reserve turf instead of just using a corner in CentCom (which had unaccounted for tiles)\r\n\r\n* Working on unit test related issues grants 6 GBP, automatically add tag (#55199)\r\n\r\nUnit tests (a label I recently added) will now give 6 GBP. This label should be added to anything that adds a new unit test, even on features.\r\n\r\n* Makes swarmers and morphs ghost-visible in the orbit menu (#55191)\r\n\r\nMakes Morphs and Swarmers have their own part of the orbit menu, like other visible antagonists. Given pretty much every other ghost-obvious antagonist is, it's more of an oversight that you couldn't.\r\n\r\n* Automatic changelog generation for PR #55191 [ci skip]\r\n\r\n* HFR runtime fix (#55189)\r\n\r\n* Automatic changelog generation for PR #55189 [ci skip]\r\n\r\n* Fixes improvised jetpacks working as infinite one tick boosters (#55202)\r\n\r\nFixes improvised jetpacks working as infinite one tick boosters\r\nallow_thrust is used as a check when the jetpack is toggled on to see if it should be allowed to turn on. This line needs to return the parent call instead of presuming it passes.\r\n\r\n* Automatic changelog generation for PR #55202 [ci skip]\r\n\r\n* Proto Nitrate reaction fix (#55188)\r\n\r\nFix runtime with proto_nitrate reaction with trit\r\n\r\n* Automatic changelog generation for PR #55188 [ci skip]\r\n\r\n* fixes ageusia (#55187)\r\n\r\n* Automatic changelog generation for PR #55187 [ci skip]\r\n\r\n* recolored skeleton sprites (#55185)\r\n\r\nskeletons no longer have eye sprites\r\ni recolored skeleton sprites a bit\r\n\r\n* Automatic changelog generation for PR #55185 [ci skip]\r\n\r\n* Changes grenade proc names to be more clear (#55181)\r\n\r\nGrenades have, for the longest time, used the proc name preprime() to refer to arming a timed grenade so that it will boom in a few seconds, and prime() to refer to the grenade actually going boom (or releasing foam or anything else grenades do when they go off). This was very confusing, so now these two procs are called arm_grenade() and detonate().\r\n\r\n* Fixes Ghost Dynamic Abductors (#55176)\r\n\r\nFixes an issue where an abductor team was created every time a midround antagonist was created by Dynamic, even if it wasn't Abductors. This was simply due to some misplaced code.\r\n\r\n* Automatic changelog generation for PR #55176 [ci skip]\r\n\r\n* adds broken states to grass (#55108)\r\n\r\ngrass now gets baseturfs\r\nadds a damaged icon for sand\r\n\r\n* Automatic changelog generation for PR #55108 [ci skip]\r\n\r\n* Mech Ammo now properly respects ammo for custom materials. (#55095)\r\n\r\nMech code now does a basic check for the amount of remaining ammo to adjust the amount of custom materials of an ammo container based on the remaining ammo against the original amount of ammo.\r\nWhen the ammo runs out, it's hard-set to 2000 iron as that's the value of the sheet of iron that it gets set to by the end.\r\n\r\n* Automatic changelog generation for PR #55095 [ci skip]\r\n\r\n* taming improvements (#55086)\r\n\r\ntame var is now set to true on the tamed proc, not right before the tamed proc in feeding proc so if an admin atom proc calls tamed the mob is tamed\r\nvatbeast no longer overrides its faction to neutral because it already sets the action to the tamer's\r\n\r\n* Automatic changelog generation for PR #55086 [ci skip]\r\n\r\n* Hauberoach's now properly give correct feedback if you're immune to their headspike. (#55079)\r\n\r\nHauberoaches now give a different, clearer line of dialog when stepped on by a pierce immune carbon mob.\r\n\r\n* Automatic changelog generation for PR #55079 [ci skip]\r\n\r\n* Remove duplicate definitions of /obj/effect/ex_act, explicitly noop it (#55076)\r\n\r\n/obj/effect/ex_act had several different re-definitions to make it a noop. The original definition would randomly delete it, which is bad news when a lot of /obj/effects are just that--effects, that shouldn't be blown up.\r\n\r\nThe ones that actually do want to be blown up (like decals) already have their own implementations. The one in place was never ran, and nobody had problems with it.\r\n\r\n* Fixes Issues Regarding Finding Spider and Swarmer Spawns (#55054)\r\n\r\nThis PR fixes the issue where people couldn't teleport to spider egg clusters using the notification.\r\n\r\nIt also adds both the swarmer beacon and spider egg clusters to the ghost orbit menu. This should make it easier to find instances of both in cases where a player might miss the initial notification.\r\n\r\n* Automatic changelog generation for PR #55054 [ci skip]\r\n\r\n* Fixing robot upgrades sometimes not being removed from lists. (#54842)\r\n\r\n* APC Fixes Pt. 1: Standardizes MetaStation APCs (#55060)\r\n\r\n* add showers to icebox and pubby atmos (#55190)\r\n\r\n* Automatic changelog generation for PR #55190 [ci skip]\r\n\r\n* Fixed cooling in the IceBox RD Server Room (#54998)\r\n\r\n* More Map Fixes (#55204)\r\n\r\n* fix pubby's incinerator errors, fix atmospheric testing room space walls\r\n\r\n* double lattice\r\n\r\n* Automatic changelog generation for PR #55204 [ci skip]\r\n\r\n* Adds N2 Canisters to the Delta Supermatter (#55205)\r\n\r\n* Does the Thing\r\n\r\n* Removes delta rad collector subtype\r\n\r\nCo-authored-by: Coffee <crashkray@gmail.coom>\r\n\r\n* Automatic changelog generation for PR #55205 [ci skip]\r\n\r\n* Automatic changelog compile, [ci skip]\r\n\r\n* Feex (#55228)\r\n\r\nMissing ! meant that if an upgrade was unequippable, it would be installable. If it wasn't unequippable, it wouldn't be installable. This is fixed.\r\n\r\nNo reason I can see for cyborg upgrades to pass through the attack chain if they fail to get installed in general. Most other things stop immediately if they fail. Removed ugly if-then-else chain as a result. I'm sure someone will correct me if I'm wrong on this, it's 2:15am and I want to sleep.\r\n\r\n(Note from lemon: the logic was quite literally backwards, I am depressed)\r\n\r\n* Automatic changelog generation for PR #55228 [ci skip]\r\n\r\n* Kills the quickswap shortcut (#55209)\r\n\r\n* Automatic changelog generation for PR #55209 [ci skip]\r\n\r\n* the flight plans filed with the agency lists etc etc (#55214)\r\n\r\nSomeone reported an issue on the discord where, since BYOS shuttles now have shuttle computers, they can now be hijacked partially or completely before it's actually time for evac. This has been confirmed as unintended behavior by anne, who submitted the hijack rework port, so this PR fixes that by requiring the shuttle to have at least \"docked\" before the ability to hijack it is available\r\n\r\n* Automatic changelog generation for PR #55214 [ci skip]\r\n\r\n* Allows dynamic game modes to be disabled (#55200)\r\n\r\nCurrently for headmins to disable game modes they need to set the list of valid threats to 101, counting on the fact that the threat level doesn't go higher than 100.\r\nThis is brittle, bypasses checks for having enough valid game modes, and a hacky solution at best.\r\n\r\nMade it so that setting the weight of a ruleset set to zero, be it via configs or by var-editing, will no longer draft it for picking, effectively disabling it.\r\n\r\n* sstimer no longer batches maintenance tasks to the bucket list to avoid edge cases and duplicated logic. (#55140)\r\n\r\n* sstimer no longer delays maintenance tasks if its going over its tick.\r\n\r\nThis was leading to bugs if certain state operations happened while a task was delayed, furthermore if the timer subsystem was overloaded, the invoked timers list would bloat as it would never get cleared out, which would make all timer invocations take longer as they had to add to an ever growing list.\r\n\r\n* Update timer.dm\r\n\r\n* Fix error when a bucket has only one timer.\r\n\r\n* simply timer loop logic & improve timer debug string\r\n\r\nIt would try to batch up linked list modifications and every issue we have ever had has been related to this, so now it just directly pulls the head of the linked list off, using bucketEject, rather then detect when it reaches the end of the linked list queue it will now just know because the bucket will be empty.\r\n\r\nAll bucketCount logic has been moved to bucketEject and bucketJoin(), which should also keep that more proper.\r\n\r\n* Update timer.dm\r\n\r\n* Update timer.dm\r\n\r\n* Changes the discord verify command from .verify to ?verify \r\n\r\nThis stops it conflicting with an existing set of commands that are for fun usage\r\n\r\n* Automatic changelog generation for PR #55212 [ci skip]\r\n\r\n* Automatic changelog compile, [ci skip]\r\n\r\n* Update links to Yarn documentation (#55235)\r\n\r\nUpdates tgui documentation to show that yarn berry (v2) is now used.\r\n\r\nCo-authored-by: oranges <email@oranges.net.nz>\r\nCo-authored-by: Aleksej Komarov <stylemistake@gmail.com>\r\n\r\n* Adds 3 periods to the game (#55243)\r\n\r\nFixes a single typo\r\n\r\n* Automatic changelog generation for PR #55243 [ci skip]\r\n\r\n* Cryopod cooling fix for humans (#55221)\r\n\r\nThe core temp was meant to be cooled separately through the skin in cryo pods, but on inspection that interaction was skipped.\r\nThis makes the core temp match skin temp in a cryo pod.\r\n\r\n* Automatic changelog generation for PR #55221 [ci skip]\r\n\r\n* Tweaks to temperature code (#55216)\r\n\r\nThis is a small tweak that makes skin temp raise up faster when cold in response to ice moon being harder.\r\nThis also makes a change to mobs in statis beds no long hold bed temp in some quantum lock but stops the natural stabilization. This means that is you put a frozen/superheated mob on the floor or a statis bed they will balance tot the room temp over time. The mob is not physically separate from the room in a statis bed and all life functions are still suspended.\r\n\r\n* Automatic changelog generation for PR #55216 [ci skip]\r\n\r\n* Automatic changelog compile, [ci skip]\r\n\r\n* Add AnturK's 'GC Issues' guide\r\n\r\n* Add Mothblocks's unit test documentation and guide\r\n\r\n* Add \"Important Types\" info from neersighted's \"Common Variables and Functions\"\r\n\r\n* Add some method descriptions from neer's \"Common Variables and Functions\"\r\n\r\n* Add dmdocs to /proc/getline\r\n\r\n* Correct some links and formatting in CONTRIBUTING\r\n\r\n* Fixes custom double-barreled shotgun back sprites (#55232)\r\n\r\nThe custom double-barrelled shotgun sprite names contained a hyphen instead of an underscore, making them appear as error sprites when worn.\r\n\r\n* Automatic changelog generation for PR #55232 [ci skip]\r\n\r\n* tgui: Round Gauge (#55230)\r\n\r\nThis PR introduces the wacky round gauge for showing all of your favourite metrics in half-circle format. Show off those wacky numbers, use some scary blinking lights, feel alive!\r\n\r\nI've also gone ahead and included this in the canister and tank (think internals) UIs. I've also done some refactoring of data sending from canisters because GOSH DANG it required some.\r\n\r\n* Automatic changelog generation for PR #55230 [ci skip]\r\n\r\n* Sets default food size to small. (#55210)\r\n\r\n## About The Pull Request\r\n\r\nFixes an oversight done during the food refactor that makes all food items normal sized instead of small.\r\nInstead of adding weight class to a bunch of individual items [(like this PR)](https://github.com/tgstation/tgstation/pull/55174) it just makes all food default to small unless tagged to be bigger.\r\n\r\n## Why It's Good For The Game\r\n\r\nBeing able to put 7 items on a tray instead of 4 is good, and if a food item is \"too powerful\", that individual item (or subtype, such as soups) can be given a larger weight class.\r\n\r\nFixes #54818\r\n\r\n* Automatic changelog generation for PR #55210 [ci skip]\r\n\r\n* Small refactor for medical stack items (#55213)\r\n\r\nSomeone DM'd me asking a question about what the 'heal' var was for on aloe, I looked into it and realized it was an unnecessary variable that just replicated what heal_brute and heal_burn do. I then realized there was quite a lot of unnecessary copypasta in medical stack code, so I made some changes to make it neater and added some documentation in to boot\r\n\r\n* More HFR fixes (#55203)\r\n\r\n- Refractor HFR core from binary device to unary device to fix issue with cooling not properly connecting, that was deleting gases when tryed to use (only one port cooling now similar to a Thermomachine)\r\n- Small fix of GUI data where two vars were inverted\r\n\r\n* Automatic changelog generation for PR #55203 [ci skip]\r\n\r\n* Removed jQuery from snowflake devices (#55090)\r\n\r\n* Removed jQuery from snowflake menus\r\n\r\n* Update code/modules/admin/verbs/beakerpanel.dm\r\n\r\nCo-authored-by: Kyle Spier-Swenson <kyleshome@gmail.com>\r\n\r\nCo-authored-by: Kyle Spier-Swenson <kyleshome@gmail.com>\r\n\r\n* Automatic changelog generation for PR #55090 [ci skip]\r\n\r\n* Fix the implosion compressor runtiming when the bomb is too weak (#55231)\r\n\r\nPreviously, the implosion compressor would runtime when the bomb was too weak due to a badly ordered QDEL_NULL. Now, it properly returns the message.\r\n\r\n* Automatic changelog generation for PR #55231 [ci skip]\r\n\r\n* Fixes oversight where pAIs are not able to select headset radio channels from encryption keys (#55215)\r\n\r\npAI integrated headsets are the only headsets that don't have `subspace_transmission = TRUE` - Ordinarily they're not able to install encryption keys, so this isn't necessary or useful to them.\r\n\r\nHowever, selecting departmental channels based on the installed encryption key is a function locked behind `subspace_transmission = TRUE` and I think the fact this flag isn't set when the pAI installs its encryption keys upgrade is most likely an oversight.\r\n\r\nThis should fix all issues where pAIs get fancy encryption keys like Captain ones, but are unable to utilise any frequencies except the default ones that come pre-enabled (such as the Cap key coming with only Sec/Command enabled and having all others disabled).\r\n\r\n* Automatic changelog generation for PR #55215 [ci skip]\r\n\r\n* make gas selling use elasticity (#55192)\r\n\r\nFix gas selling never use diminishing returns\r\n\r\n* Automatic changelog generation for PR #55192 [ci skip]\r\n\r\n* Grep for space indentation (#54850)\r\n\r\n#54604 atomizing\r\nSince a lot of the space indents are in lists ill atomize those later\r\n\r\n* Makes the usage of force_threshold in the attackby() proc for simplemobs consistent with the way it's used everywhere else (#55023)\r\n\r\n## About The Pull Request\r\n\r\nNamely, this means that a simplemob's immunity to melee attacks of force X or lower now accounts for that simplemobs damage multipliers to various damage types. It also means that simplemobs with a force_threshold of X are now immune to melee attacks of force X or lower, not melee attacks with a force less than X (<= vs. <).\r\n\r\n## Why It's Good For The Game\r\n\r\n**tldr;\r\nThis make the code for simplemob \"your stick must be this strong to deal damage\" thresholds more consistent.**\r\n\r\nXenomorphs, xenomorph larvae, barehanded monkeys, slimes, and simplemobs in general all multiply the damage of their attacks by the relevant damage resistance multiplier BEFORE checking it against the force_threshold of the simplemob they're attacking, and also check to see if their damage is <= the force_threshold of the simplemob they're attacking (instead of requiring it to be strictly < the force_threshold of the simplemob they're attacking).\r\n\r\nAs for balance concerns, while this will affect juggernauts *slightly* (as they'll now be immune to force <= 10 melee weapons instead of just force < 10 melee weapons), I'm not too worried about that. What I _am_ worried about is blobbernauts, who, after this change, will be immune to brute melee weapons of force 20 or lower (due to their 0.5 brute damage multiplier). You will, of course, still be able to welder them just as effectively as you could before, but I'm worried that this could make blob-aligned blobbernauts even stronger than they already are.\r\n\r\n* Automatic changelog generation for PR #55023 [ci skip]\r\n\r\n* grep for pixelx/y = 0 varedits (#54845)\r\n\r\nCo-authored-by: Jordan Brown <Cyberboss@users.noreply.github.com>\r\n\r\n* Fixes Nar'Sie rune erasing bug (#55123)\r\n\r\n* Automatic changelog generation for PR #55123 [ci skip]\r\n\r\n* Init sanity unit test (#55147)\r\n\r\nhttps://github.com/tgstation/TerraGov-Marine-Corps/pull/5326\r\nStemming from \r\nhttps://github.com/ParadiseSS13/Paradise/pull/14770\r\n\r\nBasically it just checks for bad initialize calls\r\n\r\n* Automatic changelog compile, [ci skip]\r\n\r\n* Remove redundant triple-backticks\r\n\r\n* Add a table of contents to CONTRIBUTING.md\r\n\r\n* Move Maintainer and Issue Manager guidelines into CONTRIBUTING\r\n\r\n* Update TGS DMAPI (#55259)\r\n\r\nCo-authored-by: tgstation-server <tgstation-server@users.noreply.github.com>\r\n\r\n* Slightly edit CONTRIBUTING\r\n\r\n* Single-space the /obj/item/proc/equipped docblock\r\n\r\n* Use block comments for get_turf and get_area\r\n\r\n* Use block comments for do_after and getline\r\n\r\n* Revert \"Update TGS DMAPI (#55259)\" (#55271)\r\n\r\nThis reverts commit d2454ee42db8ee3fc4935959ca2a0dcf88b10a18.\r\n\r\n* Luxury shuttle scanner gate bugfixes and improvements (#55107)\r\n\r\nOh man this one took me a hot second.\r\nLuxury Shuttle gates now do the following:\r\n\r\nRespect simplemobs dragging through credits so they can be considered legitimate passengers.\r\n\r\nRespect vehicles and by proxy mechs so that you don't block the narrow causway into the shuttle. Entering the gate with cash will add both yourself and the vehicle to the whitelist. Entering the gate in a whitelisted vehicle, but without paying yet will throw angry buzzing at you as expected.\r\n\r\nThe shuttle will only take the correct credit count now, or at least provide the correct change.\r\n\r\nThe scanner is now invincible as it LITERALLY only exists on a roundend shuttle.\r\n\r\n* Automatic changelog generation for PR #55107 [ci skip]\r\n\r\n* unfucks hitting simplemobs with melee attacks (sorry!) (#55269)\r\n\r\nAdds a single \"!\" to the code I added (in #55023) to make it not make most simplemobs immune to being hit with most melee weapons.\r\n\r\n* Automatic changelog generation for PR #55269 [ci skip]\r\n\r\n* Ports custom food to new food datum (#55207)\r\n\r\nCo-authored-by: Bobbahbrown <bobbahbrown@gmail.com>\r\nCo-authored-by: Jared-Fogle <35135081+Jared-Fogle@users.noreply.github.com>\r\n\r\n* Automatic changelog generation for PR #55207 [ci skip]\r\n\r\n* Maybe fixes DMAPI Update PR not triggering actions (#55297)\r\n\r\n* Revert \"Removed jQuery from snowflake devices\" (#55272)\r\n\r\n* Revert \"Removed jQuery from snowflake devices (#55090)\"\r\n\r\nThis reverts commit ee47cb5289b688b4a902e305d798cc500f098bd8.\r\n\r\n* linting SUCKS\r\n\r\n* Fixes detdrobe construction bug (#55264)\r\n\r\nLets detectives disassemble their vendor to restock it I guess.\r\nThey could rebuild it if someone else broke in and took it apart too?\r\n\r\n* Automatic changelog generation for PR #55264 [ci skip]\r\n\r\n* Make unit tests visible to linter and IDE (#55270)\r\n\r\n* Fixes newfood reagent transfer and food trash' to_chat (#55150)\r\n\r\nCo-authored-by: Jared-Fogle <35135081+Jared-Fogle@users.noreply.github.com>\r\n\r\n* Automatic changelog generation for PR #55150 [ci skip]\r\n\r\n* You can('t) whisper into comms in crit. (#54970)\r\n\r\n* Stops critted people from speaking into the radio.\r\n\r\n* Whitelist implementation and removal of unreachable/unused code.\r\n\r\n* Woops.\r\n\r\n* Automatic changelog generation for PR #54970 [ci skip]\r\n\r\n* Calms down the linter. (#55312)\r\n\r\n* Makes fearless trait affect social anxiety (#55284)\r\n\r\nAn oversight from when I added psicodine and happiness\r\n\r\n* Automatic changelog generation for PR #55284 [ci skip]\r\n\r\n* Fixes perspective of mood messages (#55290)\r\n\r\n* Automatic changelog generation for PR #55290 [ci skip]\r\n\r\n* Fixes new players harddeling when the player logs out (#55295)\r\n\r\n* Fixes the lipstick sprites (#55281)\r\n\r\n* Extends the IC chat filter to be checked in two major renaming procs (#55217)\r\n\r\nAbout The Pull Request\r\n\r\nHonestly, I'm not sure this is the... Correct solution? But people more familiar with this will likely show me da wae.\r\n\r\nProhibits creating names that can't actually be spoken in-character due to chat filters by adding CHAT_FILTER_CHECKs to the procs that handle sanitising them.\r\n\r\nFor admin-utilised renaming procs, they'll be given a simple alert box to warn them their chosen name contains words prohibited by the IC chat filter and be allowed to confirm or cancel out.\r\nWhy It's Good For The Game\r\n\r\nIf you can't speak the name IC, chances are the name shouldn't be allowed at all. Players may occasionally be forced to ahelp certain names because they contain words prohibited in chat filters.\r\n\r\n* Automatic changelog generation for PR #55217 [ci skip]\r\n\r\n* 'cause it shouldn't happen (#55288)\r\n\r\n* Automatic changelog generation for PR #55288 [ci skip]\r\n\r\n* Automatic changelog compile, [ci skip]\r\n\r\n* new dark gygax sprites (cool and edgy) (#55293)\r\n\r\nnew dark gygax sprites\r\n\r\n* Automatic changelog generation for PR #55293 [ci skip]\r\n\r\n* Update TGS DMAPI (#55323)\r\n\r\nCo-authored-by: tgstation-server <tgstation-server@users.noreply.github.com>\r\n\r\n* Automatic changelog compile, [ci skip]\r\n\r\n* Adds amputation shear suicide (#55308)\r\n\r\n* part 1\r\n\r\n* now works\r\n\r\n* uhhuh\r\n\r\n* and i oop\r\n\r\n* snip snip\r\n\r\n* SNIP SNIP\r\n\r\nCo-authored-by: Coffee <crashkray@gmail.coom>\r\n\r\n* Automatic changelog generation for PR #55308 [ci skip]\r\n\r\n* Fixes borg upgrades with action buttons being broken (#55305)\r\n\r\nFixes #55257\r\nYou can probably also currently install upgrades somehow stuck to your hand, and if so this would also fix that.\r\n\r\n* Automatic changelog generation for PR #55305 [ci skip]\r\n\r\n* Automatic changelog compile, [ci skip]\r\n\r\n* Automatic changelog compile, [ci skip]\r\n\r\n* fixes nanodrug unused sprite (#55300)\r\n\r\nNanoDrug Plus has a distinct sprite to NanoMed Plus. It isn't used. This uses it.\r\n\r\n* Automatic changelog generation for PR #55300 [ci skip]\r\n\r\n* Make RCD suicide place wall and gib user (#55283)\r\n\r\n* Make RCD suicide place wall\r\n\r\n* gibbing should return MANUAL_SUICIDE\r\n\r\n* return SHAME if no ammo\r\n\r\n* Only set RCD to wall if the message says so\r\n\r\n* Automatic changelog generation for PR #55283 [ci skip]\r\n\r\nCo-authored-by: tgstation-server <tgstation-server@tgstation13.org>\r\nCo-authored-by: ArcaneMusic <41715314+ArcaneMusic@users.noreply.github.com>\r\nCo-authored-by: Fikou <piotrbryla@onet.pl>\r\nCo-authored-by: Maurukas <66576896+Maurukas@users.noreply.github.com>\r\nCo-authored-by: Jared-Fogle <35135081+Jared-Fogle@users.noreply.github.com>\r\nCo-authored-by: Qustinnus <Floydje123@hotmail.com>\r\nCo-authored-by: Changelogs <action@github.com>\r\nCo-authored-by: Ryll Ryll <3589655+Ryll-Ryll@users.noreply.github.com>\r\nCo-authored-by: Jordan Brown <Cyberboss@users.noreply.github.com>\r\nCo-authored-by: spookydonut <github@spooksoftware.com>\r\nCo-authored-by: cacogen <25089914+cacogen@users.noreply.github.com>\r\nCo-authored-by: ArcaneDefence <51932756+ArcaneDefence@users.noreply.github.com>\r\nCo-authored-by: prodirus <44090982+prodirus@users.noreply.github.com>\r\nCo-authored-by: Ghom <42542238+Ghommie@users.noreply.github.com>\r\nCo-authored-by: zxaber <37497534+zxaber@users.noreply.github.com>\r\nCo-authored-by: Bond <58570888+TheBonded@users.noreply.github.com>\r\nCo-authored-by: antropod <antropod@gmail.com>\r\nCo-authored-by: Yenwodyah <yenwodyah@gmail.com>\r\nCo-authored-by: ATH1909 <42606352+ATH1909@users.noreply.github.com>\r\nCo-authored-by: Timberpoes <silent_insomnia_pp@hotmail.co.uk>\r\nCo-authored-by: Arkatos1 <43862960+Arkatos1@users.noreply.github.com>\r\nCo-authored-by: Aleksej Komarov <stylemistake@gmail.com>\r\nCo-authored-by: Coffee <CoffeeDragon16@gmail.com>\r\nCo-authored-by: itseasytosee <55666666+itseasytosee@users.noreply.github.com>\r\nCo-authored-by: NightRed <nightred@gmail.com>\r\nCo-authored-by: Bobbahbrown <bobbahbrown@gmail.com>\r\nCo-authored-by: TemporalOroboros <TemporalOroboros@gmail.com>\r\nCo-authored-by: MrMelbert <51863163+MrMelbert@users.noreply.github.com>\r\nCo-authored-by: skoglol <33292112+kriskog@users.noreply.github.com>\r\nCo-authored-by: LordVollkorn <66637090+LordVollkorn@users.noreply.github.com>\r\nCo-authored-by: LemonInTheDark <58055496+LemonInTheDark@users.noreply.github.com>\r\nCo-authored-by: tattlemothe <66640614+dragomagol@users.noreply.github.com>\r\nCo-authored-by: Ghilker <42839747+Ghilker@users.noreply.github.com>\r\nCo-authored-by: IndieanaJones <47086570+IndieanaJones@users.noreply.github.com>\r\nCo-authored-by: Cartographer-D <63861499+Cartographer-D@users.noreply.github.com>\r\nCo-authored-by: Josh <josh@jaw.sh>\r\nCo-authored-by: Coffee <crashkray@gmail.coom>\r\nCo-authored-by: Rohesie <rohesie@gmail.com>\r\nCo-authored-by: Kyle Spier-Swenson <kyleshome@gmail.com>\r\nCo-authored-by: Mordent <62817778+mordent-goonstation@users.noreply.github.com>\r\nCo-authored-by: oranges <email@oranges.net.nz>\r\nCo-authored-by: Tad Hardesty <tad@platymuus.com>\r\nCo-authored-by: Winter Flare <7543955+Owai-Seek@users.noreply.github.com>\r\nCo-authored-by: WarlockD <warlockd@gmail.com>\r\nCo-authored-by: TiviPlus <57223640+TiviPlus@users.noreply.github.com>\r\nCo-authored-by: github-actions[bot] <41898282+github-actions[bot]@users.noreply.github.com>\r\nCo-authored-by: tgstation-server <tgstation-server@users.noreply.github.com>\r\nCo-authored-by: Jack LeCroy <3073035+jacklecroy@users.noreply.github.com>\r\nCo-authored-by: AnturK <AnturK@users.noreply.github.com>\r\nCo-authored-by: Mickyan <38563876+Mickyan@users.noreply.github.com>\r\nCo-authored-by: Tom <tomforde4@gmail.com>\r\nCo-authored-by: sergeirocks100 <31294280+sergeirocks100@users.noreply.github.com>\r\nCo-authored-by: Urumasi <Urumasi@email.cz>"}},"url":"https://api.github.com/repos/MMMiracles/tgstation/commits/cf84297c3574ccd375ab24a9379199e2f66421fc","html_url":"https://github.com/MMMiracles/tgstation/commit/cf84297c3574ccd375ab24a9379199e2f66421fc","comments_url":"https://api.github.com/repos/MMMiracles/tgstation/commits/cf84297c3574ccd375ab24a9379199e2f66421fc/comments","author":{"login":"MMMiracles","id":9276171,"node_id":"MDQ6VXNlcjkyNzYxNzE=","avatar_url":"https://avatars.githubusercontent.com/u/9276171?v=4","gravatar_id":"","url":"https://api.github.com/users/MMMiracles","html_url":"https://github.com/MMMiracles","followers_url":"https://api.github.com/users/MMMiracles/followers","following_url":"https://api.github.com/users/MMMiracles/following{/other_user}","gists_url":"https://api.github.com/users/MMMiracles/gists{/gist_id}","starred_url":"https://api.github.com/users/MMMiracles/starred{/owner}{/repo}","subscriptions_url":"https://api.github.com/users/MMMiracles/subscriptions","organizations_url":"https://api.github.com/users/MMMiracles/orgs","repos_url":"https://api.github.com/users/MMMiracles/repos","events_url":"https://api.github.com/users/MMMiracles/events{/privacy}","received_events_url":"https://api.github.com/users/MMMiracles/received_events","type":"User","site_admin":false},"committer":{"login":"web-flow","id":19864447,"node_id":"MDQ6VXNlcjE5ODY0NDQ3","avatar_url":"https://avatars.githubusercontent.com/u/19864447?v=4","gravatar_id":"","url":"https://api.github.com/users/web-flow","html_url":"https://github.com/web-flow","followers_url":"https://api.github.com/users/web-flow/followers","following_url":"https://api.github.com/users/web-flow/following{/other_user}","gists_url":"https://api.github.com/users/web-flow/gists{/gist_id}","starred_url":"https://api.github.com/users/web-flow/starred{/owner}{/repo}","subscriptions_url":"https://api.github.com/users/web-flow/subscriptions","organizations_url":"https://api.github.com/users/web-flow/orgs","repos_url":"https://api.github.com/users/web-flow/repos","events_url":"https://api.github.com/users/web-flow/events{/privacy}","received_events_url":"https://api.github.com/users/web-flow/received_events","type":"User","site_admin":false},"parents":[{"sha":"05971b811f5e5e10c825fc4c6bcb8e2c442ea8ca","url":"https://api.github.com/repos/MMMiracles/tgstation/commits/05971b811f5e5e10c825fc4c6bcb8e2c442ea8ca","html_url":"https://github.com/MMMiracles/tgstation/commit/05971b811f5e5e10c825fc4c6bcb8e2c442ea8ca"}]}]